In [1]:
import pandas as pd
import datetime as dt
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
sns.set(style='darkgrid')
from matplotlib.pylab import rcParams
plt.style.use('fivethirtyeight')

from fbprophet import Prophet as proph

### Import CSVs

In [2]:
domestic_2019_df = pd.read_csv('T100D_2019_data.csv')

In [3]:
domestic_2019_df.shape

(122975, 19)

In [4]:
domestic_2018_df = pd.read_csv('T100D_2018_data.csv')

In [5]:
domestic_2018_df.shape

(250353, 19)

In [6]:
domestic_2017_df = pd.read_csv('T100D_2017_data.csv')

In [7]:
domestic_2016_df = pd.read_csv('T100D_2016_data.csv')

In [8]:
domestic_2015_df = pd.read_csv('T100D_2015_data.csv')

In [9]:
domestic_2014_df = pd.read_csv('T100D_2014_data.csv')

In [10]:
domestic_2013_df = pd.read_csv('T100D_2013_data.csv')

In [11]:
domestic_2012_df = pd.read_csv('T100D_2012_data.csv')

In [12]:
domestic_2011_df = pd.read_csv('T100D_2011_data.csv')

In [13]:
domestic_2010_df = pd.read_csv('T100D_2010_data.csv')

In [14]:
domestic_df = pd.concat([domestic_2019_df, domestic_2018_df, domestic_2017_df, domestic_2016_df, domestic_2015_df,
                        domestic_2014_df, domestic_2013_df, domestic_2012_df, domestic_2011_df, domestic_2010_df])

In [15]:
domestic_df

,PASSENGERS,DISTANCE,UNIQUE_CARRIER,UNIQUE_CARRIER_NAME,ORIGIN_AIRPORT_ID,ORIGIN_CITY_MARKET_ID,ORIGIN,ORIGIN_CITY_NAME,ORIGIN_STATE_NM,DEST_AIRPORT_ID,DEST_CITY_MARKET_ID,DEST,DEST_CITY_NAME,DEST_STATE_NM,YEAR,MONTH,DISTANCE_GROUP,CLASS,Unnamed: 18
0,0.0,1241.0,0WQ,Avjet Corporation,10423,30423,AUS,"Austin, TX",Texas,10800,32575,BUR,"Burbank, CA",California,2019,1,3,L,NaN
1,0.0,256.0,0WQ,Avjet Corporation,10800,32575,BUR,"Burbank, CA",California,13476,34922,MRY,"Monterey, CA",California,2019,1,1,L,NaN
2,0.0,325.0,0WQ,Avjet Corporation,10800,32575,BUR,"Burbank, CA",California,13796,32457,OAK,"Oakland, CA",California,2019,1,1,L,NaN
3,0.0,46.0,0WQ,Avjet Corporation,10800,32575,BUR,"Burbank, CA",California,14908,32575,SNA,"Santa Ana, CA",California,2019,1,1,L,NaN
4,0.0,100.0,0WQ,Avjet Corporation,12173,32134,HNL,"Honolulu, HI",Hawaii,13830,33830,OGG,"Kahului, HI",Hawaii,2019,1,1,L,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
263157,83752.0,403.0,DL,Delta Air Lines Inc.,10397,30397,ATL,"Atlanta, GA",Georgia,13204,31454,MCO,"Orlando, FL",Florida,2010,10,1,F,NaN
263158,84322.0,100.0,HA,Hawaiian Airlines Inc.,12173,32134,HNL,"Honolulu, HI",Hawaii,13830,33830,OGG,"Kahului, HI",Hawaii,2010,7,1,F,NaN
263159,84717.0,100.0,HA,Hawaiian Airlines Inc.,13830,33830,OGG,"Kahului, HI",Hawaii,12173,32134,HNL,"Honolulu, HI",Hawaii,2010,8,1,F,NaN
263160,85216.0,403.0,DL,Delta Air Lines Inc.,10397,30397,ATL,"Atlanta, GA",Georgia,13204,31454,MCO,"Orlando, FL",Florida,2010,3,1,F,NaN
263161,86174.0,100.0,HA,Hawaiian Airlines Inc.,13830,33830,OGG,"Kahului, HI",Hawaii,12173,32134,HNL,"Honolulu, HI",Hawaii,2010,7,1,F,NaN

In [16]:
del domestic_df['Unnamed: 18']

The 'CITY_MARKET_ID' column groups airports in different cities that serve the same market, so we'll use that as the main identifier for a destination. Supplementary tables are provided detailing the city market based on code, which we'll include in the table.

In [17]:
domestic_df.set_index('DEST_CITY_MARKET_ID', inplace=True)

In [18]:
#import supplementary table of markets based on city market ID
markets = pd.read_csv('L_CITY_MARKET_ID.csv', index_col='Code')

In [19]:
#join tables for additional column of market 
domestic_df = domestic_df.join(markets, how='left')

In [20]:
domestic_df.isna().sum()

PASSENGERS                 0
DISTANCE                   0
UNIQUE_CARRIER           358
UNIQUE_CARRIER_NAME      171
ORIGIN_AIRPORT_ID          0
ORIGIN_CITY_MARKET_ID      0
ORIGIN                     0
ORIGIN_CITY_NAME           0
ORIGIN_STATE_NM            0
DEST_AIRPORT_ID            0
DEST                       0
DEST_CITY_NAME             0
DEST_STATE_NM              0
YEAR                       0
MONTH                      0
DISTANCE_GROUP             0
CLASS                      0
Description                0
dtype: int64

In [21]:
domestic_df['Day'] = 1

In [22]:
#create Datetime column
domestic_df['ds'] = pd.to_datetime(domestic_df[['YEAR','MONTH', 'Day']])

INFO:numexpr.utils:NumExpr defaulting to 4 threads.

In [23]:
domestic_df.set_index('ds', inplace=True)

In [24]:
domestic_df.head()

,PASSENGERS,DISTANCE,UNIQUE_CARRIER,UNIQUE_CARRIER_NAME,ORIGIN_AIRPORT_ID,ORIGIN_CITY_MARKET_ID,ORIGIN,ORIGIN_CITY_NAME,ORIGIN_STATE_NM,DEST_AIRPORT_ID,DEST,DEST_CITY_NAME,DEST_STATE_NM,YEAR,MONTH,DISTANCE_GROUP,CLASS,Description,Day
ds,,,,,,,,,,,,,,,,,,,
2019-06-01,6.0,109.0,8E,Bering Air Inc.,13970,33970,OTZ,"Kotzebue, AK",Alaska,11946,GMT,"Granite Mountain, AK",Alaska,2019,6,1,L,"Granite Mountain, AK",1
2014-07-01,3.0,137.0,8E,Bering Air Inc.,13873,33873,OME,"Nome, AK",Alaska,11946,GMT,"Granite Mountain, AK",Alaska,2014,7,1,L,"Granite Mountain, AK",1
2013-08-01,0.0,137.0,8E,Bering Air Inc.,13873,33873,OME,"Nome, AK",Alaska,11946,GMT,"Granite Mountain, AK",Alaska,2013,8,1,L,"Granite Mountain, AK",1
2013-09-01,0.0,147.0,7S,Ryan Air f/k/a Arctic Transportation,13873,33873,OME,"Nome, AK",Alaska,10003,03A,"Granite Mountain, AK",Alaska,2013,9,1,G,"Granite Mountain, AK",1
2013-07-01,3.0,137.0,8E,Bering Air Inc.,13873,33873,OME,"Nome, AK",Alaska,11946,GMT,"Granite Mountain, AK",Alaska,2013,7,1,L,"Granite Mountain, AK",1

In [25]:
domestic_df = domestic_df[['PASSENGERS', 'Description']]
domestic_df.head()

            PASSENGERS           Description
ds
2019-06-01         6.0  Granite Mountain, AK
2014-07-01         3.0  Granite Mountain, AK
2013-08-01         0.0  Granite Mountain, AK
2013-09-01         0.0  Granite Mountain, AK
2013-07-01         3.0  Granite Mountain, AK

In [26]:
domestic_df['city'] = domestic_df['Description'].apply(lambda x: x.split(',')[0].split('/')[0])

In [27]:
domestic_df.head()

            PASSENGERS           Description              city
ds
2019-06-01         6.0  Granite Mountain, AK  Granite Mountain
2014-07-01         3.0  Granite Mountain, AK  Granite Mountain
2013-08-01         0.0  Granite Mountain, AK  Granite Mountain
2013-09-01         0.0  Granite Mountain, AK  Granite Mountain
2013-07-01         3.0  Granite Mountain, AK  Granite Mountain

In [28]:
sums = pd.DataFrame(domestic_df.groupby('Description')['PASSENGERS'].sum())

Find top 25 US cities visited

In [29]:
top_cities = sums.sort_values('PASSENGERS', ascending=False)
top_25 = list(top_cities[:25].index)
top_25

['Atlanta, GA (Metropolitan Area)',
 'New York City, NY (Metropolitan Area)',
 'Chicago, IL',
 'Los Angeles, CA (Metropolitan Area)',
 'Dallas/Fort Worth, TX',
 'Washington, DC (Metropolitan Area)',
 'San Francisco, CA (Metropolitan Area)',
 'Denver, CO',
 'Houston, TX',
 'Miami, FL (Metropolitan Area)',
 'Phoenix, AZ',
 'Las Vegas, NV',
 'Charlotte, NC',
 'Seattle, WA',
 'Orlando, FL',
 'Boston, MA (Metropolitan Area)',
 'Minneapolis/St. Paul, MN',
 'Detroit, MI',
 'Philadelphia, PA',
 'Salt Lake City, UT',
 'San Diego, CA',
 'Tampa, FL (Metropolitan Area)',
 'Portland, OR',
 'Honolulu, HI',
 'St. Louis, MO']

In [30]:
#remove cities not in top 25 from US dataframe
domestic_df = domestic_df[domestic_df['Description'].apply(lambda x: x in top_25)]

In [31]:
domestic_df.head()

            PASSENGERS            Description    city
ds
2019-01-01         0.0  Dallas/Fort Worth, TX  Dallas
2019-01-01         0.0  Dallas/Fort Worth, TX  Dallas
2019-01-01         0.0  Dallas/Fort Worth, TX  Dallas
2019-01-01         0.0  Dallas/Fort Worth, TX  Dallas
2019-01-01         0.0  Dallas/Fort Worth, TX  Dallas

In [32]:
#group by day and destination
domestic_df = pd.DataFrame(domestic_df.groupby([domestic_df.index,'Description', 'city'])['PASSENGERS'].sum().reset_index())

In [33]:
domestic_df['Type'] = 'Domestic'

In [34]:
domestic_df.head()

          ds                      Description       city  PASSENGERS      Type
0 2010-01-01  Atlanta, GA (Metropolitan Area)    Atlanta   2735491.0  Domestic
1 2010-01-01   Boston, MA (Metropolitan Area)     Boston   1008661.0  Domestic
2 2010-01-01                    Charlotte, NC  Charlotte   1221593.0  Domestic
3 2010-01-01                      Chicago, IL    Chicago   2427421.0  Domestic
4 2010-01-01            Dallas/Fort Worth, TX     Dallas   2114255.0  Domestic

## Import International Data

In [35]:
international_df = pd.read_csv('International_data.csv', header=[1])
international_df

,Region,Hong Kong SAR (China),United Kingdom,Singapore,France,United Arab Emirates,Malaysia,Thailand,India,Japan,Italy,Turkey,Taiwan,Netherlands,South Korea,Spain,Germany,Greece,Croatia,Iceland
0,Jan-10,"1,906,253","4,830,092","1,681,005","4,154,249","1,878,388","2,601,868","749,879","1,499,009",NaN,"2,297,141","513,811","214,118","1,489,035",NaN,"1,672,945",NaN,NaN,"165,000","38,726"
1,Feb-10,"1,903,106","4,600,406","1,499,346","3,821,563","1,803,584","2,531,547","746,204","1,493,435",NaN,"2,190,848","1,056,434","251,329","1,416,049",NaN,"1,828,004",NaN,NaN,"145,000","37,292"
2,Mar-10,"1,996,482","5,211,877","1,674,208","4,654,929","1,930,197","2,802,885","693,866","1,554,893",NaN,"2,791,984","1,904,256","241,466","1,762,140",NaN,"2,287,264",NaN,NaN,"199,000","48,812"
3,Apr-10,"2,066,587","4,446,530","1,617,186","4,062,475","1,815,735","2,648,646","569,080","1,631,005",NaN,"2,912,851","3,007,152","286,677","1,472,647",NaN,"2,229,097",NaN,NaN,"267,000","42,197"
4,May-10,"1,989,423","5,255,772","1,613,748","5,199,610","1,766,404","2,729,223","426,423","1,844,582",NaN,"3,239,359","5,416,059","311,368","2,068,682",NaN,"2,511,974",NaN,NaN,"492,000","51,566"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
122,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
123,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
124,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
125,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
126,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [36]:
international_df = international_df.rename(columns = {'Region':'ds'})

In [37]:
international_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 127 entries, 0 to 126
Data columns (total 20 columns):
ds                       114 non-null object
Hong Kong SAR (China)    114 non-null object
United Kingdom           114 non-null object
Singapore                114 non-null object
France                   114 non-null object
United Arab Emirates     108 non-null object
Malaysia                 114 non-null object
Thailand                 114 non-null object
India                    114 non-null object
Japan                    90 non-null object
Italy                    114 non-null object
Turkey                   114 non-null object
Taiwan                   114 non-null object
Netherlands              114 non-null object
South Korea              65 non-null object
Spain                    114 non-null object
Germany                  102 non-null object
Greece                   81 non-null object
Croatia                  114 non-null object
Iceland                  114 non-null object
dtypes: object(20)
memory usage: 20.0+ KB

In [38]:
international_df['ds'] = pd.to_datetime(international_df['ds'],format='%b-%y', yearfirst=False)

In [39]:
international_df.head()

,ds,Hong Kong SAR (China),United Kingdom,Singapore,France,United Arab Emirates,Malaysia,Thailand,India,Japan,Italy,Turkey,Taiwan,Netherlands,South Korea,Spain,Germany,Greece,Croatia,Iceland
0,2010-01-01,"1,906,253","4,830,092","1,681,005","4,154,249","1,878,388","2,601,868","749,879","1,499,009",NaN,"2,297,141","513,811","214,118","1,489,035",NaN,"1,672,945",NaN,NaN,"165,000","38,726"
1,2010-02-01,"1,903,106","4,600,406","1,499,346","3,821,563","1,803,584","2,531,547","746,204","1,493,435",NaN,"2,190,848","1,056,434","251,329","1,416,049",NaN,"1,828,004",NaN,NaN,"145,000","37,292"
2,2010-03-01,"1,996,482","5,211,877","1,674,208","4,654,929","1,930,197","2,802,885","693,866","1,554,893",NaN,"2,791,984","1,904,256","241,466","1,762,140",NaN,"2,287,264",NaN,NaN,"199,000","48,812"
3,2010-04-01,"2,066,587","4,446,530","1,617,186","4,062,475","1,815,735","2,648,646","569,080","1,631,005",NaN,"2,912,851","3,007,152","286,677","1,472,647",NaN,"2,229,097",NaN,NaN,"267,000","42,197"
4,2010-05-01,"1,989,423","5,255,772","1,613,748","5,199,610","1,766,404","2,729,223","426,423","1,844,582",NaN,"3,239,359","5,416,059","311,368","2,068,682",NaN,"2,511,974",NaN,NaN,"492,000","51,566"

In [40]:
#impute subsequent value for that month and location to NaNs:
# international_df = international_df.fillna(value=None, method='backfill', axis=None, limit=35, downcast=None)

In [41]:
international_df = international_df[international_df.ds < '2019-02-01']

In [42]:
international_df.head()

,ds,Hong Kong SAR (China),United Kingdom,Singapore,France,United Arab Emirates,Malaysia,Thailand,India,Japan,Italy,Turkey,Taiwan,Netherlands,South Korea,Spain,Germany,Greece,Croatia,Iceland
0,2010-01-01,"1,906,253","4,830,092","1,681,005","4,154,249","1,878,388","2,601,868","749,879","1,499,009",NaN,"2,297,141","513,811","214,118","1,489,035",NaN,"1,672,945",NaN,NaN,"165,000","38,726"
1,2010-02-01,"1,903,106","4,600,406","1,499,346","3,821,563","1,803,584","2,531,547","746,204","1,493,435",NaN,"2,190,848","1,056,434","251,329","1,416,049",NaN,"1,828,004",NaN,NaN,"145,000","37,292"
2,2010-03-01,"1,996,482","5,211,877","1,674,208","4,654,929","1,930,197","2,802,885","693,866","1,554,893",NaN,"2,791,984","1,904,256","241,466","1,762,140",NaN,"2,287,264",NaN,NaN,"199,000","48,812"
3,2010-04-01,"2,066,587","4,446,530","1,617,186","4,062,475","1,815,735","2,648,646","569,080","1,631,005",NaN,"2,912,851","3,007,152","286,677","1,472,647",NaN,"2,229,097",NaN,NaN,"267,000","42,197"
4,2010-05-01,"1,989,423","5,255,772","1,613,748","5,199,610","1,766,404","2,729,223","426,423","1,844,582",NaN,"3,239,359","5,416,059","311,368","2,068,682",NaN,"2,511,974",NaN,NaN,"492,000","51,566"

In [43]:
#impute following value for that month and location to NaNs:

international_df = international_df.fillna(value=None, method='ffill', axis=None, limit=35, downcast=None)

In [44]:
international_df.isna().sum()

ds                        0
Hong Kong SAR (China)     0
United Kingdom            0
Singapore                 0
France                    0
United Arab Emirates      0
Malaysia                  0
Thailand                  0
India                     0
Japan                    24
Italy                     0
Turkey                    0
Taiwan                    0
Netherlands               0
South Korea              31
Spain                     0
Germany                  12
Greece                   33
Croatia                   0
Iceland                   0
dtype: int64

In [45]:
international_df = pd.DataFrame(international_df.set_index('ds').unstack()).reset_index()
international_df

                    level_0         ds            0
0     Hong Kong SAR (China) 2010-01-01   1,906,253
1     Hong Kong SAR (China) 2010-02-01   1,903,106
2     Hong Kong SAR (China) 2010-03-01   1,996,482
3     Hong Kong SAR (China) 2010-04-01   2,066,587
4     Hong Kong SAR (China) 2010-05-01   1,989,423
...                     ...        ...          ...
2066                Iceland 2018-09-01     265,842
2067                Iceland 2018-10-01     263,587
2068                Iceland 2018-11-01     184,982
2069                Iceland 2018-12-01     186,853
2070                Iceland 2019-01-01     164,744

[2071 rows x 3 columns]

In [46]:
international_df = international_df.rename(columns = {'level_0': 'city', 0: 'PASSENGERS'})

In [47]:
international_df['Type'] = 'International'

In [48]:
international_df.head()

                    city         ds   PASSENGERS           Type
0  Hong Kong SAR (China) 2010-01-01   1,906,253   International
1  Hong Kong SAR (China) 2010-02-01   1,903,106   International
2  Hong Kong SAR (China) 2010-03-01   1,996,482   International
3  Hong Kong SAR (China) 2010-04-01   2,066,587   International
4  Hong Kong SAR (China) 2010-05-01   1,989,423   International

In [49]:
international_df.loc[international_df['city'] == 'Hong Kong SAR (China)', 'city'] = 'Hong Kong'

In [50]:
international_df.loc[international_df['city'] == 'United Kingdom', 'city'] = 'London'
international_df.loc[international_df['city'] == 'France', 'city'] = 'Paris'
international_df.loc[international_df['city'] == 'United Arab Emirates', 'city'] = 'Dubai'
international_df.loc[international_df['city'] == 'Malaysia', 'city'] = 'Kuala Lumpur'
international_df.loc[international_df['city'] == 'Thailand', 'city'] = 'Phuket'
international_df.loc[international_df['city'] == 'India', 'city'] = 'Delhi'
international_df.loc[international_df['city'] == 'Japan', 'city'] = 'Tokyo'
international_df.loc[international_df['city'] == 'Italy', 'city'] = 'Rome'
international_df.loc[international_df['city'] == 'Turkey', 'city'] = 'Antalya'
international_df.loc[international_df['city'] == 'Taiwan', 'city'] = 'Taipei'
international_df.loc[international_df['city'] == 'Netherlands', 'city'] = 'Amsterdam'
international_df.loc[international_df['city'] == 'South Korea', 'city'] = 'Seoul'
international_df.loc[international_df['city'] == 'Spain', 'city'] = 'Barcelona'
international_df.loc[international_df['city'] == 'Germany', 'city'] = 'Berlin'
international_df.loc[international_df['city'] == 'Greece', 'city'] = 'Athens'
international_df.loc[international_df['city'] == 'Iceland', 'city'] = 'Reykjavik'

In [51]:
international_df

           city         ds   PASSENGERS           Type
0     Hong Kong 2010-01-01   1,906,253   International
1     Hong Kong 2010-02-01   1,903,106   International
2     Hong Kong 2010-03-01   1,996,482   International
3     Hong Kong 2010-04-01   2,066,587   International
4     Hong Kong 2010-05-01   1,989,423   International
...         ...        ...          ...            ...
2066  Reykjavik 2018-09-01     265,842   International
2067  Reykjavik 2018-10-01     263,587   International
2068  Reykjavik 2018-11-01     184,982   International
2069  Reykjavik 2018-12-01     186,853   International
2070  Reykjavik 2019-01-01     164,744   International

[2071 rows x 4 columns]

In [52]:
combined_df = pd.concat([domestic_df, international_df], sort=False)

In [53]:
combined_df

,ds,Description,city,PASSENGERS,Type
0,2010-01-01,"Atlanta, GA (Metropolitan Area)",Atlanta,2.73549e+06,Domestic
1,2010-01-01,"Boston, MA (Metropolitan Area)",Boston,1.00866e+06,Domestic
2,2010-01-01,"Charlotte, NC",Charlotte,1.22159e+06,Domestic
3,2010-01-01,"Chicago, IL",Chicago,2.42742e+06,Domestic
4,2010-01-01,"Dallas/Fort Worth, TX",Dallas,2.11426e+06,Domestic
...,...,...,...,...,...
2066,2018-09-01,NaN,Reykjavik,"265,842",International
2067,2018-10-01,NaN,Reykjavik,"263,587",International
2068,2018-11-01,NaN,Reykjavik,"184,982",International
2069,2018-12-01,NaN,Reykjavik,"186,853",International
2070,2019-01-01,NaN,Reykjavik,"164,744",International

In [54]:
combined_df['Month'] = combined_df.ds.apply(lambda x: x.month)

In [55]:
combined_df.isna().sum()

ds                0
Description    2071
city              0
PASSENGERS      100
Type              0
Month             0
dtype: int64

In [56]:
combined_df.groupby(['city', 'Month'])['PASSENGERS']

In [57]:
#impute following value for that month and location to NaNs:
combined_df.PASSENGERS = combined_df.groupby(['city', 'Month']).PASSENGERS.bfill()

In [58]:
combined_df

,ds,Description,city,PASSENGERS,Type,Month
0,2010-01-01,"Atlanta, GA (Metropolitan Area)",Atlanta,2.73549e+06,Domestic,1
1,2010-01-01,"Boston, MA (Metropolitan Area)",Boston,1.00866e+06,Domestic,1
2,2010-01-01,"Charlotte, NC",Charlotte,1.22159e+06,Domestic,1
3,2010-01-01,"Chicago, IL",Chicago,2.42742e+06,Domestic,1
4,2010-01-01,"Dallas/Fort Worth, TX",Dallas,2.11426e+06,Domestic,1
...,...,...,...,...,...,...
2066,2018-09-01,NaN,Reykjavik,"265,842",International,9
2067,2018-10-01,NaN,Reykjavik,"263,587",International,10
2068,2018-11-01,NaN,Reykjavik,"184,982",International,11
2069,2018-12-01,NaN,Reykjavik,"186,853",International,12
2070,2019-01-01,NaN,Reykjavik,"164,744",International,1

In [59]:
del combined_df['Description']
del combined_df['Month']

In [60]:
combined_df.isna().sum()

ds            0
city          0
PASSENGERS    0
Type          0
dtype: int64

## Get Weather Data

In [61]:
import requests

In [62]:
dom_cities = list(map(lambda x: x.split('(')[0].split(',')[0].split('/')[0], top_25))
for i, city in enumerate(dom_cities):
    dom_cities[i] = city.replace(' ', '_')
    
dom_cities

['Atlanta',
 'New_York_City',
 'Chicago',
 'Los_Angeles',
 'Dallas',
 'Washington',
 'San_Francisco',
 'Denver',
 'Houston',
 'Miami',
 'Phoenix',
 'Las_Vegas',
 'Charlotte',
 'Seattle',
 'Orlando',
 'Boston',
 'Minneapolis',
 'Detroit',
 'Philadelphia',
 'Salt_Lake_City',
 'San_Diego',
 'Tampa',
 'Portland',
 'Honolulu',
 'St._Louis']

In [63]:
int_cities = list(map(lambda x: x.split('(')[0].split(',')[0].split('/')[0], international_df['city'].unique()))
for i, city in enumerate(int_cities):
    int_cities[i] = city.replace(' ', '_')
    
int_cities

['Hong_Kong',
 'London',
 'Singapore',
 'Paris',
 'Dubai',
 'Kuala_Lumpur',
 'Phuket',
 'Delhi',
 'Tokyo',
 'Rome',
 'Antalya',
 'Taipei',
 'Amsterdam',
 'Seoul',
 'Barcelona',
 'Berlin',
 'Athens',
 'Croatia',
 'Reykjavik']

In [64]:
cities = dom_cities + int_cities

In [65]:
api_key = 'exbuNW5R'

In [66]:
stations = {}
for city in cities:
    try:
        response = requests.get(f'https://api.meteostat.net/v1/stations/search?q={city}&key=exbuNW5R').json()
        station = response['data'][0]['id']
        stations[f'{city}'] = station
    except:
        stations[f'{city}'] = 'Not Available'

In [67]:
stations

{'Atlanta': '72219',
 'New_York_City': 'KNYC0',
 'Chicago': '72530',
 'Los_Angeles': '72295',
 'Dallas': '72259',
 'Washington': '72406',
 'San_Francisco': '72494',
 'Denver': '72565',
 'Houston': '72243',
 'Miami': '72202',
 'Phoenix': '72278',
 'Las_Vegas': '78373',
 'Charlotte': '72314',
 'Seattle': '72793',
 'Orlando': '72205',
 'Boston': '72509',
 'Minneapolis': '72658',
 'Detroit': '72537',
 'Philadelphia': '72408',
 'Salt_Lake_City': '72572',
 'San_Diego': '72290',
 'Tampa': '72211',
 'Portland': '72606',
 'Honolulu': '91182',
 'St._Louis': 'KSUS0',
 'Hong_Kong': '45007',
 'London': '68858',
 'Singapore': '48698',
 'Paris': '07149',
 'Dubai': '41194',
 'Kuala_Lumpur': 'Not Available',
 'Phuket': '48564',
 'Delhi': '42182',
 'Tokyo': '47662',
 'Rome': '87576',
 'Antalya': '17300',
 'Taipei': '46696',
 'Amsterdam': '06240',
 'Seoul': '47110',
 'Barcelona': '08181',
 'Berlin': '10381',
 'Athens': '72311',
 'Croatia': 'Not Available',
 'Reykjavik': '04030'}

In [68]:
requests.get(f'https://api.meteostat.net/v1/stations/search?q=fuzhou&key=exbuNW5R').json()

{'meta': {}, 'data': [{'id': '58847', 'country': 'CN', 'name': 'Fuzhou'}]}

In [69]:
stations['New_York_City'] = 72503
stations['St._Louis'] = 72434
stations['Washington'] = 72406
stations['Kuala_Lumpur'] = 48665
stations['Taipei'] = 46756
stations['Croatia'] = 14474
stations['Las_Vegas'] = 72488
stations['Croatia'] = 14445
stations['Hong_Kong'] = 59431
stations['Seoul'] = 47108
stations['Phuket'] = 48565
stations['Amsterdam'] = 10312
stations['Taipei'] = 58847

In [70]:
stations

{'Atlanta': '72219',
 'New_York_City': 72503,
 'Chicago': '72530',
 'Los_Angeles': '72295',
 'Dallas': '72259',
 'Washington': 72406,
 'San_Francisco': '72494',
 'Denver': '72565',
 'Houston': '72243',
 'Miami': '72202',
 'Phoenix': '72278',
 'Las_Vegas': 72488,
 'Charlotte': '72314',
 'Seattle': '72793',
 'Orlando': '72205',
 'Boston': '72509',
 'Minneapolis': '72658',
 'Detroit': '72537',
 'Philadelphia': '72408',
 'Salt_Lake_City': '72572',
 'San_Diego': '72290',
 'Tampa': '72211',
 'Portland': '72606',
 'Honolulu': '91182',
 'St._Louis': 72434,
 'Hong_Kong': 59431,
 'London': '68858',
 'Singapore': '48698',
 'Paris': '07149',
 'Dubai': '41194',
 'Kuala_Lumpur': 48665,
 'Phuket': 48565,
 'Delhi': '42182',
 'Tokyo': '47662',
 'Rome': '87576',
 'Antalya': '17300',
 'Taipei': 58847,
 'Amsterdam': 10312,
 'Seoul': 47108,
 'Barcelona': '08181',
 'Berlin': '10381',
 'Athens': '72311',
 'Croatia': 14445,
 'Reykjavik': '04030'}

In [71]:
def get_weather_data(stations):
    city_weather_history = []
    city = {}

    for i, v in stations.items():
        response = requests.get(f'https://api.meteostat.net/v1/history/monthly?station={v}&start=2009-01&end=2019-01&key=exbuNW5R').json() 
        for m in response['data']:
            try:
                month = {}
                month['city_name'] = i
                month['month'] = m['month']
                month['temperature_mean'] = m['temperature_mean']
                month['precipitation'] = m['precipitation']
                month['rain_days'] = m['raindays']
                month['pressure'] = m['pressure']

                city_weather_history.append(month) 
#                 print(f"Retrieved {i}'s weather data")
            except:
                month['city_name'] = i
                month['month'] = 0
                month['temperature_mean'] = 0
                month['precipitation'] = 0
                month['rain_days'] = 0
                month['pressure'] = 0
                city_weather_history.append(month) 
#                 print(f"Could not retrieve {i}'s weather data")
    
    return city_weather_history

In [72]:
requests.get(f'https://api.meteostat.net/v1/history/monthly?station=58847&start=2009-01&end=2019-01&key=exbuNW5R').json()

{'meta': {'source': 'National Oceanic and Atmospheric Administration, Deutscher Wetterdienst'},
 'data': [{'month': '2009-01',
   'temperature_mean': 10.7,
   'temperature_mean_min': 7.2,
   'temperature_mean_max': 15.7,
   'temperature_min': 1.5,
   'temperature_max': 24.2,
   'precipitation': 24,
   'raindays': 4,
   'pressure': 1025,
   'sunshine': 147},
  {'month': '2009-02',
   'temperature_mean': 15.5,
   'temperature_mean_min': 12.4,
   'temperature_mean_max': 21.1,
   'temperature_min': 7.4,
   'temperature_max': 29.7,
   'precipitation': 12,
   'raindays': 2,
   'pressure': 1017.9,
   'sunshine': 94},
  {'month': '2009-03',
   'temperature_mean': 14.2,
   'temperature_mean_min': 11.1,
   'temperature_mean_max': 18.7,
   'temperature_min': 6.1,
   'temperature_max': 29.3,
   'precipitation': 115,
   'raindays': 14,
   'pressure': 1018.2,
   'sunshine': 93},
  {'month': '2009-04',
   'temperature_mean': 18.8,
   'temperature_mean_min': 15.6,
   'temperature_mean_max': 23.7,
   'temperature_min': 10.6,
   'temperature_max': 30.5,
   'precipitation': 105,
   'raindays': 10,
   'pressure': 1015.3,
   'sunshine': 124},
  {'month': '2009-05',
   'temperature_mean': 23.1,
   'temperature_mean_min': 19.1,
   'temperature_mean_max': 28.4,
   'temperature_min': 13.6,
   'temperature_max': 35.2,
   'precipitation': 71,
   'raindays': 5,
   'pressure': 1012.4,
   'sunshine': 180},
  {'month': '2009-06',
   'temperature_mean': 26.3,
   'temperature_mean_min': 23.3,
   'temperature_mean_max': 30.9,
   'temperature_min': 17,
   'temperature_max': 36.3,
   'precipitation': 262,
   'raindays': 14,
   'pressure': 1005.4,
   'sunshine': 128},
  {'month': '2009-07',
   'temperature_mean': 29.4,
   'temperature_mean_min': 26.1,
   'temperature_mean_max': 34.2,
   'temperature_min': 22,
   'temperature_max': 37.1,
   'precipitation': 212,
   'raindays': 9,
   'pressure': 1005.4,
   'sunshine': 197},
  {'month': '2009-08',
   'temperature_mean': 29.3,
   'temperature_mean_min': 25.9,
   'temperature_mean_max': 34.1,
   'temperature_min': 23.7,
   'temperature_max': 38.4,
   'precipitation': 378,
   'raindays': 13,
   'pressure': 1004.5,
   'sunshine': 177},
  {'month': '2009-09',
   'temperature_mean': 28.1,
   'temperature_mean_min': 25.6,
   'temperature_mean_max': 32.3,
   'temperature_min': 23.9,
   'temperature_max': 36.9,
   'precipitation': 24,
   'raindays': 3,
   'pressure': 1010,
   'sunshine': 120},
  {'month': '2009-10',
   'temperature_mean': 23.2,
   'temperature_mean_min': 19.9,
   'temperature_mean_max': 27.4,
   'temperature_min': 16.5,
   'temperature_max': 32.1,
   'precipitation': 11,
   'raindays': 1,
   'pressure': 1015.3,
   'sunshine': 168},
  {'month': '2009-11',
   'temperature_mean': 17.3,
   'temperature_mean_min': 14.6,
   'temperature_mean_max': 21.1,
   'temperature_min': 8.2,
   'temperature_max': 31.4,
   'precipitation': 94,
   'raindays': 6,
   'pressure': 1020.7,
   'sunshine': 91},
  {'month': '2009-12',
   'temperature_mean': 12.7,
   'temperature_mean_min': 10.2,
   'temperature_mean_max': 16.8,
   'temperature_min': 4,
   'temperature_max': 23.6,
   'precipitation': 67,
   'raindays': 9,
   'pressure': 1022.7,
   'sunshine': 89},
  {'month': '2010-01',
   'temperature_mean': 12,
   'temperature_mean_min': 9.3,
   'temperature_mean_max': 16.3,
   'temperature_min': 3.7,
   'temperature_max': 25.5,
   'precipitation': 63,
   'raindays': 10,
   'pressure': 1023.9,
   'sunshine': 78},
  {'month': '2010-02',
   'temperature_mean': 13.3,
   'temperature_mean_min': 10.5,
   'temperature_mean_max': 17.6,
   'temperature_min': 4,
   'temperature_max': 29.2,
   'precipitation': 139,
   'raindays': 12,
   'pressure': 1019.4,
   'sunshine': 75},
  {'month': '2010-03',
   'temperature_mean': 14.9,
   'temperature_mean_min': 11.2,
   'temperature_mean_max': 20.5,
   'temperature_min': 2.4,
   'temperature_max': 29.3,
   'precipitation': 166,
   'raindays': 11,
   'pressure': 1019.7,
   'sunshine': 122},
  {'month': '2010-04',
   'temperature_mean': 16.8,
   'temperature_mean_min': 13.8,
   'temperature_mean_max': 21.3,
   'temperature_min': 8.9,
   'temperature_max': 31.1,
   'precipitation': 326,
   'raindays': 17,
   'pressure': 1017.5,
   'sunshine': 75},
  {'month': '2010-05',
   'temperature_mean': 22.2,
   'temperature_mean_min': 19.4,
   'temperature_mean_max': 26.3,
   'temperature_min': 16,
   'temperature_max': 33.3,
   'precipitation': 174,
   'raindays': 17,
   'pressure': 1010.3,
   'sunshine': 100},
  {'month': '2010-06',
   'temperature_mean': 24.8,
   'temperature_mean_min': 22.5,
   'temperature_mean_max': 28.2,
   'temperature_min': 17.8,
   'temperature_max': 36.4,
   'precipitation': 315,
   'raindays': 16,
   'pressure': 1008.3,
   'sunshine': 61},
  {'month': '2010-07',
   'temperature_mean': 29.9,
   'temperature_mean_min': 26.5,
   'temperature_mean_max': 35.2,
   'temperature_min': 23.6,
   'temperature_max': 38,
   'precipitation': 123,
   'raindays': 7,
   'pressure': 1007.2,
   'sunshine': 217},
  {'month': '2010-08',
   'temperature_mean': 30,
   'temperature_mean_min': 26.3,
   'temperature_mean_max': 35.3,
   'temperature_min': 23.3,
   'temperature_max': 38.4,
   'precipitation': 53,
   'raindays': 5,
   'pressure': 1008.2,
   'sunshine': 234},
  {'month': '2010-09',
   'temperature_mean': 27.7,
   'temperature_mean_min': 24.9,
   'temperature_mean_max': 31.9,
   'temperature_min': 21.7,
   'temperature_max': 36.5,
   'precipitation': 132,
   'raindays': 11,
   'pressure': 1010.2,
   'sunshine': 150},
  {'month': '2010-10',
   'temperature_mean': 21.8,
   'temperature_mean_min': 19.5,
   'temperature_mean_max': 24.9,
   'temperature_min': 11.5,
   'temperature_max': 31.8,
   'precipitation': 62,
   'raindays': 6,
   'pressure': 1016,
   'sunshine': 85},
  {'month': '2010-11',
   'temperature_mean': 17.6,
   'temperature_mean_min': 14.7,
   'temperature_mean_max': 21.4,
   'temperature_min': 11.3,
   'temperature_max': 25.7,
   'precipitation': 11,
   'raindays': 4,
   'pressure': 1020.5,
   'sunshine': 117},
  {'month': '2010-12',
   'temperature_mean': 13.4,
   'temperature_mean_min': 9.5,
   'temperature_mean_max': 18.8,
   'temperature_min': 1.3,
   'temperature_max': 26.9,
   'precipitation': 40,
   'raindays': 4,
   'pressure': 1019.2,
   'sunshine': 172},
  {'month': '2011-01',
   'temperature_mean': 8,
   'temperature_mean_min': 6.2,
   'temperature_mean_max': 10.7,
   'temperature_min': 2.1,
   'temperature_max': 15.8,
   'precipitation': 20,
   'raindays': 5,
   'pressure': 1026.4,
   'sunshine': 35},
  {'month': '2011-02',
   'temperature_mean': 11.4,
   'temperature_mean_min': 8.3,
   'temperature_mean_max': 16.3,
   'temperature_min': 4,
   'temperature_max': 28.8,
   'precipitation': 52,
   'raindays': 7,
   'pressure': 1020.5,
   'sunshine': 88},
  {'month': '2011-03',
   'temperature_mean': 12.7,
   'temperature_mean_min': 9.5,
   'temperature_mean_max': 17.6,
   'temperature_min': 5.5,
   'temperature_max': 28.7,
   'precipitation': 38,
   'raindays': 5,
   'pressure': 1022.9,
   'sunshine': 88},
  {'month': '2011-04',
   'temperature_mean': 19.4,
   'temperature_mean_min': 15.1,
   'temperature_mean_max': 25.5,
   'temperature_min': 8.6,
   'temperature_max': 35.7,
   'precipitation': 35,
   'raindays': 6,
   'pressure': 1015.7,
   'sunshine': 162},
  {'month': '2011-05',
   'temperature_mean': 22,
   'temperature_mean_min': 18.9,
   'temperature_mean_max': 26.3,
   'temperature_min': 13.9,
   'temperature_max': 35.4,
   'precipitation': 251,
   'raindays': 15,
   'pressure': 1010.9,
   'sunshine': 124},
  {'month': '2011-06',
   'temperature_mean': 28.8,
   'temperature_mean_min': 25.8,
   'temperature_mean_max': 33.7,
   'temperature_min': 21.8,
   'temperature_max': 38.4,
   'precipitation': 99,
   'raindays': 6,
   'pressure': 1005.6,
   'sunshine': 144},
  {'month': '2011-07',
   'temperature_mean': 29.3,
   'temperature_mean_min': 26.1,
   'temperature_mean_max': 34.4,
   'temperature_min': 23.5,
   'temperature_max': 38.7,
   'precipitation': 259,
   'raindays': 11,
   'pressure': 1004.6,
   'sunshine': 202},
  {'month': '2011-08',
   'temperature_mean': 29.2,
   'temperature_mean_min': 25.5,
   'temperature_mean_max': 34.4,
   'temperature_min': 21.1,
   'temperature_max': 38.6,
   'precipitation': 228,
   'raindays': 13,
   'pressure': 1005.9,
   'sunshine': 214},
  {'month': '2011-09',
   'temperature_mean': 26.7,
   'temperature_mean_min': 24.1,
   'temperature_mean_max': 30.5,
   'temperature_min': 19.4,
   'temperature_max': 35.4,
   'precipitation': 41,
   'raindays': 6,
   'pressure': 1010.4,
   'sunshine': 115},
  {'month': '2011-10',
   'temperature_mean': 21.9,
   'temperature_mean_min': 19.4,
   'temperature_mean_max': 25.7,
   'temperature_min': 15,
   'temperature_max': 31.2,
   'precipitation': 45,
   'raindays': 5,
   'pressure': 1017.6,
   'sunshine': 98},
  {'month': '2011-11',
   'temperature_mean': 19.9,
   'temperature_mean_min': 17.8,
   'temperature_mean_max': 22.9,
   'temperature_min': 12.1,
   'temperature_max': 30.1,
   'precipitation': 155,
   'raindays': 7,
   'pressure': 1018.9,
   'sunshine': 57},
  {'month': '2011-12',
   'temperature_mean': 12.7,
   'temperature_mean_min': 10.3,
   'temperature_mean_max': 16.2,
   'temperature_min': 5.1,
   'temperature_max': 24.3,
   'precipitation': 23,
   'raindays': 5,
   'pressure': 1025.1,
   'sunshine': 67},
  {'month': '2012-01',
   'temperature_mean': 10,
   'temperature_mean_min': 8.7,
   'temperature_mean_max': 12.2,
   'temperature_min': 2.7,
   'temperature_max': 20.3,
   'precipitation': 159,
   'raindays': 13,
   'pressure': 1023.4,
   'sunshine': 15},
  {'month': '2012-02',
   'temperature_mean': 10.6,
   'temperature_mean_min': 8.3,
   'temperature_mean_max': 14.4,
   'temperature_min': 4.6,
   'temperature_max': 25.5,
   'precipitation': 165,
   'raindays': 14,
   'pressure': 1021.4,
   'sunshine': 35},
  {'month': '2012-03',
   'temperature_mean': 14.6,
   'temperature_mean_min': 11.4,
   'temperature_mean_max': 19.4,
   'temperature_min': 6.6,
   'temperature_max': 31.4,
   'precipitation': 87,
   'raindays': 11,
   'pressure': 1019.2,
   'sunshine': 101},
  {'month': '2012-04',
   'temperature_mean': 20,
   'temperature_mean_min': 17,
   'temperature_mean_max': 24.7,
   'temperature_min': 10,
   'temperature_max': 31.2,
   'precipitation': 252,
   'raindays': 20,
   'pressure': 1013.4,
   'sunshine': 95},
  {'month': '2012-05',
   'temperature_mean': 23,
   'temperature_mean_min': 20,
   'temperature_mean_max': 27.1,
   'temperature_min': 16,
   'temperature_max': 33.6,
   'precipitation': 265,
   'raindays': 15,
   'pressure': 1009.7,
   'sunshine': 76},
  {'month': '2012-06',
   'temperature_mean': 26.5,
   'temperature_mean_min': 23.8,
   'temperature_mean_max': 30.7,
   'temperature_min': 20.4,
   'temperature_max': 37.1,
   'precipitation': 252,
   'raindays': 11,
   'pressure': 1004.3,
   'sunshine': 97},
  {'month': '2012-07',
   'temperature_mean': 29.9,
   'temperature_mean_min': 26.3,
   'temperature_mean_max': 35.2,
   'temperature_min': 22.7,
   'temperature_max': 39.2,
   'precipitation': 53,
   'raindays': 9,
   'pressure': 1005.3,
   'sunshine': 228},
  {'month': '2012-08',
   'temperature_mean': 28.8,
   'temperature_mean_min': 25.8,
   'temperature_mean_max': 33.3,
   'temperature_min': 23.5,
   'temperature_max': 36.3,
   'precipitation': 283,
   'raindays': 10,
   'pressure': 1003.6,
   'sunshine': 175},
  {'month': '2012-09',
   'temperature_mean': 25.8,
   'temperature_mean_min': 23,
   'temperature_mean_max': 30.1,
   'temperature_min': 18.8,
   'temperature_max': 34.9,
   'precipitation': 164,
   'raindays': 4,
   'pressure': 1012,
   'sunshine': 134},
  {'month': '2012-10',
   'temperature_mean': 22.4,
   'temperature_mean_min': 18.8,
   'temperature_mean_max': 27.3,
   'temperature_min': 14.1,
   'temperature_max': 31.2,
   'precipitation': 15,
   'raindays': 2,
   'pressure': 1017,
   'sunshine': 188},
  {'month': '2012-11',
   'temperature_mean': 17.7,
   'temperature_mean_min': 15.2,
   'temperature_mean_max': 21.2,
   'temperature_min': 10.6,
   'temperature_max': 29.5,
   'precipitation': 158,
   'raindays': 13,
   'pressure': 1018.7,
   'sunshine': 76},
  {'month': '2012-12',
   'temperature_mean': 12.8,
   'temperature_mean_min': 10.6,
   'temperature_mean_max': 16.3,
   'temperature_min': 0.8,
   'temperature_max': 27.6,
   'precipitation': 63,
   'raindays': 9,
   'pressure': 1022.4,
   'sunshine': 71},
  {'month': '2013-01',
   'temperature_mean': 10.6,
   'temperature_mean_min': 7.9,
   'temperature_mean_max': 14.9,
   'temperature_min': 2.6,
   'temperature_max': 24,
   'precipitation': 4,
   'raindays': 1,
   'pressure': 1024,
   'sunshine': 81},
  {'month': '2013-02',
   'temperature_mean': 12.7,
   'temperature_mean_min': 10.2,
   'temperature_mean_max': 17.1,
   'temperature_min': 4.7,
   'temperature_max': 28.6,
   'precipitation': 44,
   'raindays': 4,
   'pressure': 1021.9,
   'sunshine': 56},
  {'month': '2013-03',
   'temperature_mean': 15.1,
   'temperature_mean_min': 11.4,
   'temperature_mean_max': 21.3,
   'temperature_min': 5.4,
   'temperature_max': 29.9,
   'precipitation': 104,
   'raindays': 11,
   'pressure': 1018,
   'sunshine': 137},
  {'month': '2013-04',
   'temperature_mean': 17.4,
   'temperature_mean_min': 13.9,
   'temperature_mean_max': 22.9,
   'temperature_min': 8.3,
   'temperature_max': 29.9,
   'precipitation': 122,
   'raindays': 10,
   'pressure': 1014.4,
   'sunshine': 91},
  {'month': '2013-05',
   'temperature_mean': 22.9,
   'temperature_mean_min': 20.3,
   'temperature_mean_max': 27.3,
   'temperature_min': 11.8,
   'temperature_max': 35.3,
   'precipitation': 244,
   'raindays': 13,
   'pressure': 1010,
   'sunshine': 92},
  {'month': '2013-06',
   'temperature_mean': 26.7,
   'temperature_mean_min': 24,
   'temperature_mean_max': 31.4,
   'temperature_min': 20,
   'temperature_max': 36.4,
   'precipitation': 197,
   'raindays': 9,
   'pressure': 1006.3,
   'sunshine': 137},
  {'month': '2013-07',
   'temperature_mean': 29.8,
   'temperature_mean_min': 26.1,
   'temperature_mean_max': 35.1,
   'temperature_min': 23.6,
   'temperature_max': 38.8,
   'precipitation': 73,
   'raindays': 8,
   'pressure': 1007.3,
   'sunshine': 249},
  {'month': '2013-08',
   'temperature_mean': 29.6,
   'temperature_mean_min': 26.1,
   'temperature_mean_max': 34.9,
   'temperature_min': 24.1,
   'temperature_max': 40.6,
   'precipitation': 140,
   'raindays': 10,
   'pressure': 1005.5,
   'sunshine': 197},
  {'month': '2013-09',
   'temperature_mean': 26.8,
   'temperature_mean_min': 24.1,
   'temperature_mean_max': 30.7,
   'temperature_min': 22,
   'temperature_max': 34.7,
   'precipitation': 53,
   'raindays': 5,
   'pressure': 1011.2,
   'sunshine': 142},
  {'month': '2013-10',
   'temperature_mean': 22.9,
   'temperature_mean_min': 19.7,
   'temperature_mean_max': 27.8,
   'temperature_min': 13.9,
   'temperature_max': 32.1,
   'precipitation': 3,
   'raindays': 1,
   'pressure': 1016.1,
   'sunshine': 182},
  {'month': '2013-11',
   'temperature_mean': 17.8,
   'temperature_mean_min': 15.1,
   'temperature_mean_max': 22,
   'temperature_min': 6.3,
   'temperature_max': 30.7,
   'precipitation': 64,
   'raindays': 6,
   'pressure': 1020.9,
   'sunshine': 111},
  {'month': '2013-12',
   'temperature_mean': 12,
   'temperature_mean_min': 9.3,
   'temperature_mean_max': 16.1,
   'temperature_min': 3.2,
   'temperature_max': 22.5,
   'precipitation': 90,
   'raindays': 6,
   'pressure': 1022.8,
   'sunshine': 104},
  {'month': '2014-01',
   'temperature_mean': 11.8,
   'temperature_mean_min': 8,
   'temperature_mean_max': 17.5,
   'temperature_min': 2,
   'temperature_max': 25.9,
   'precipitation': 5,
   'raindays': 3,
   'pressure': 1024.2,
   'sunshine': 164},
  {'month': '2014-02',
   'temperature_mean': 11.5,
   'temperature_mean_min': 8.9,
   'temperature_mean_max': 16.1,
   'temperature_min': 3.6,
   'temperature_max': 27.9,
   'precipitation': 120,
   'raindays': 11,
   'pressure': 1020.8,
   'sunshine': 67},
  {'month': '2014-03',
   'temperature_mean': 14.9,
   'temperature_mean_min': 11.9,
   'temperature_mean_max': 19.8,
   'temperature_min': 7,
   'temperature_max': 31.7,
   'precipitation': 89,
   'raindays': 15,
   'pressure': 1019.9,
   'sunshine': 95},
  {'month': '2014-04',
   'temperature_mean': 19.2,
   'temperature_mean_min': 16,
   'temperature_mean_max': 24.2,
   'temperature_min': 9.9,
   'temperature_max': 32.8,
   'precipitation': 168,
   'raindays': 8,
   'pressure': 1015.5,
   'sunshine': 119},
  {'month': '2014-05',
   'temperature_mean': 22.5,
   'temperature_mean_min': 19.5,
   'temperature_mean_max': 27.2,
   'temperature_min': 13.7,
   'temperature_max': 33.9,
   'precipitation': 304,
   'raindays': 17,
   'pressure': 1011.2,
   'sunshine': 76},
  {'month': '2014-06',
   'temperature_mean': 26.5,
   'temperature_mean_min': 23.6,
   'temperature_mean_max': 31,
   'temperature_min': 21,
   'temperature_max': 34.8,
   'precipitation': 262,
   'raindays': 14,
   'pressure': 1005.1,
   'sunshine': 130},
  {'month': '2014-07',
   'temperature_mean': 30.1,
   'temperature_mean_min': 26.6,
   'temperature_mean_max': 35.2,
   'temperature_min': 24.4,
   'temperature_max': 37.9,
   'precipitation': 210,
   'raindays': 9,
   'pressure': 1005.3,
   'sunshine': 239},
  {'month': '2014-08',
   'temperature_mean': 29.1,
   'temperature_mean_min': 25.7,
   'temperature_mean_max': 34.5,
   'temperature_min': 23.6,
   'temperature_max': 37.1,
   'precipitation': 358,
   'raindays': 15,
   'pressure': 1006.6,
   'sunshine': 189},
  {'month': '2014-09',
   'temperature_mean': 28.6,
   'temperature_mean_min': 25.8,
   'temperature_mean_max': 33.2,
   'temperature_min': 21.7,
   'temperature_max': 37.1,
   'precipitation': 42,
   'raindays': 7,
   'pressure': 1009.7,
   'sunshine': 157},
  {'month': '2014-10',
   'temperature_mean': 23.3,
   'temperature_mean_min': 20,
   'temperature_mean_max': 28.1,
   'temperature_min': 16.1,
   'temperature_max': 33.7,
   'precipitation': 4,
   'raindays': 1,
   'pressure': 1017.1,
   'sunshine': 167},
  {'month': '2014-11',
   'temperature_mean': 19.3,
   'temperature_mean_min': 17,
   'temperature_mean_max': 22.5,
   'temperature_min': 12.7,
   'temperature_max': 31,
   'precipitation': 27,
   'raindays': 5,
   'pressure': 1019.7,
   'sunshine': 69},
  {'month': '2014-12',
   'temperature_mean': 12.3,
   'temperature_mean_min': 9.5,
   'temperature_mean_max': 16.4,
   'temperature_min': 4.8,
   'temperature_max': 22.8,
   'precipitation': 34,
   'raindays': 4,
   'pressure': 1025.4,
   'sunshine': 119},
  {'month': '2015-01',
   'temperature_mean': 11.6,
   'temperature_mean_min': 8.6,
   'temperature_mean_max': 16.4,
   'temperature_min': 4.3,
   'temperature_max': 24.4,
   'precipitation': 39,
   'raindays': 3,
   'pressure': 1024.6,
   'sunshine': 124},
  {'month': '2015-02',
   'temperature_mean': 12.5,
   'temperature_mean_min': 9.8,
   'temperature_mean_max': 17.2,
   'temperature_min': 2.6,
   'temperature_max': 27.4,
   'precipitation': 12,
   'raindays': 4,
   'pressure': 1022.3,
   'sunshine': 75},
  {'month': '2015-03',
   'temperature_mean': 14.7,
   'temperature_mean_min': 11.8,
   'temperature_mean_max': 19.1,
   'temperature_min': 6.6,
   'temperature_max': 32.6,
   'precipitation': 51,
   'raindays': 8,
   'pressure': 1020.7,
   'sunshine': 100},
  {'month': '2015-04',
   'temperature_mean': 20.3,
   'temperature_mean_min': 16.4,
   'temperature_mean_max': 25.5,
   'temperature_min': 9.8,
   'temperature_max': 34.7,
   'precipitation': 110,
   'raindays': 8,
   'pressure': 1015.3,
   'sunshine': 152},
  {'month': '2015-05',
   'temperature_mean': 23,
   'temperature_mean_min': 20.2,
   'temperature_mean_max': 27.6,
   'temperature_min': 14.6,
   'temperature_max': 35.7,
   'precipitation': 266,
   'raindays': 19,
   'pressure': 1010,

In [73]:
weather_data = pd.DataFrame(get_weather_data(stations))

In [74]:
weather_data

      city_name    month  temperature_mean  precipitation  rain_days  pressure
0       Atlanta  2009-01               6.5           73.0       10.0    1019.6
1       Atlanta  2009-02               8.6           94.0        4.0    1022.3
2       Atlanta  2009-03              12.8          181.0        8.0    1020.4
3       Atlanta  2009-04              15.9          132.0        9.0    1016.8
4       Atlanta  2009-05              21.2          115.0       14.0    1016.8
...         ...      ...               ...            ...        ...       ...
5283  Reykjavik  2018-09               7.1           75.0       15.0    1004.6
5284  Reykjavik  2018-10               3.9          114.0       21.0     998.5
5285  Reykjavik  2018-11               4.2          107.0        9.0    1002.3
5286  Reykjavik  2018-12               2.7           82.0       16.0     998.5
5287  Reykjavik  2019-01               0.5          103.0       18.0    1007.1

[5288 rows x 6 columns]

In [75]:
weather_data['city_name'] = weather_data['city_name'].apply(lambda x: x.replace('_', ' '))

In [76]:
#create Datetime column
weather_data['Year'] = weather_data.month.apply(lambda x: x.split('-')[0])
weather_data['Month'] = weather_data.month.apply(lambda x: x.split('-')[1])
weather_data['Day'] = 1
weather_data['month'] = pd.to_datetime(weather_data[['Year','Month', 'Day']])

In [77]:
weather_data.isna().sum()

city_name             0
month                 0
temperature_mean      3
precipitation        55
rain_days            33
pressure            174
Year                  0
Month                 0
Day                   0
dtype: int64

In [78]:
#impute mean temperature for that month and location to NaNs:
weather_data['temperature_mean'] = weather_data.groupby(['city_name', 'Month'])['temperature_mean'].transform(lambda x: x.fillna(x.mean()))

In [79]:
#impute mean precipitation for that month and location to NaNs:
weather_data['precipitation'] = weather_data.groupby(['city_name', 'Month'])['precipitation'].transform(lambda x: x.fillna(x.mean()))

In [80]:
#impute mean rain_days for that month and location to NaNs:
weather_data['rain_days'] = weather_data.groupby(['city_name', 'Month'])['rain_days'].transform(lambda x: x.fillna(x.mean()))

In [81]:
#impute mean pressure for that month and location to NaNs:
weather_data['pressure'] = weather_data.groupby(['city_name', 'Month'])['pressure'].transform(lambda x: x.fillna(x.mean()))

In [82]:
#impute mean pressure of dataset to NaNs where not available:
weather_data['pressure'] = weather_data['pressure'].transform(lambda x: x.fillna(x.mean()))

In [83]:
weather_data.isna().sum()

city_name           0
month               0
temperature_mean    0
precipitation       0
rain_days           0
pressure            0
Year                0
Month               0
Day                 0
dtype: int64

### Merge domestic df and weather

In [84]:
combined_df2 = combined_df.merge(weather_data, how='left', left_on = ['ds', 'city'], right_on = ['month', 'city_name'])

In [85]:
combined_df2 = combined_df2[combined_df2['ds'] < '2019-02-01']

In [86]:
combined_df2.head()

,ds,city,PASSENGERS,Type,city_name,month,temperature_mean,precipitation,rain_days,pressure,Year,Month,Day
0,2010-01-01,Atlanta,2.73549e+06,Domestic,Atlanta,2010-01-01,3.6,137.0,7.0,1019.500000,2010,01,1.0
1,2010-01-01,Boston,1.00866e+06,Domestic,Boston,2010-01-01,-1.3,60.0,5.0,1012.000000,2010,01,1.0
2,2010-01-01,Charlotte,1.22159e+06,Domestic,Charlotte,2010-01-01,3.1,124.0,7.0,1018.300000,2010,01,1.0
3,2010-01-01,Chicago,2.42742e+06,Domestic,Chicago,2010-01-01,-5.5,29.0,4.0,1020.000000,2010,01,1.0
4,2010-01-01,Dallas,2.11426e+06,Domestic,Dallas,2010-01-01,6.6,72.0,6.0,1020.711111,2010,01,1.0

In [87]:
combined_df2.isna().sum()

ds                   0
city                 0
PASSENGERS           0
Type                 0
city_name           12
month               12
temperature_mean    12
precipitation       12
rain_days           12
pressure            12
Year                12
Month               12
Day                 12
dtype: int64

In [88]:
combined_df2['Month'] = combined_df2['ds'].apply(lambda x: x.month)

In [89]:
combined_df2['Year'] = combined_df2['ds'].apply(lambda x: x.year)

In [90]:
combined_df2.head()

,ds,city,PASSENGERS,Type,city_name,month,temperature_mean,precipitation,rain_days,pressure,Year,Month,Day
0,2010-01-01,Atlanta,2.73549e+06,Domestic,Atlanta,2010-01-01,3.6,137.0,7.0,1019.500000,2010,1,1.0
1,2010-01-01,Boston,1.00866e+06,Domestic,Boston,2010-01-01,-1.3,60.0,5.0,1012.000000,2010,1,1.0
2,2010-01-01,Charlotte,1.22159e+06,Domestic,Charlotte,2010-01-01,3.1,124.0,7.0,1018.300000,2010,1,1.0
3,2010-01-01,Chicago,2.42742e+06,Domestic,Chicago,2010-01-01,-5.5,29.0,4.0,1020.000000,2010,1,1.0
4,2010-01-01,Dallas,2.11426e+06,Domestic,Dallas,2010-01-01,6.6,72.0,6.0,1020.711111,2010,1,1.0

In [91]:
combined_df2['temperature_mean'] = combined_df2.groupby(['city', 'Month'])['temperature_mean'].transform(lambda x: x.fillna(value=None, method='backfill', axis=None, limit=35, downcast=None))
combined_df2['precipitation'] = combined_df2.groupby(['city', 'Month'])['precipitation'].transform(lambda x: x.fillna(value=None, method='backfill', axis=None, limit=35, downcast=None))
combined_df2['rain_days'] = combined_df2.groupby(['city', 'Month'])['rain_days'].transform(lambda x: x.fillna(value=None, method='backfill', axis=None, limit=35, downcast=None))
combined_df2['pressure'] = combined_df2.groupby(['city', 'Month'])['pressure'].transform(lambda x: x.fillna(value=None, method='backfill', axis=None, limit=35, downcast=None))

In [92]:
combined_df2.isna().sum()

ds                   0
city                 0
PASSENGERS           0
Type                 0
city_name           12
month               12
temperature_mean     0
precipitation        0
rain_days            0
pressure             0
Year                 0
Month                0
Day                 12
dtype: int64

In [93]:
combined_df2 = combined_df2[['ds', 'city', 'PASSENGERS', 'Type','Month', 'Year','temperature_mean', 'precipitation', 'rain_days', 'pressure']]

In [94]:
combined_df2.head()

,ds,city,PASSENGERS,Type,Month,Year,temperature_mean,precipitation,rain_days,pressure
0,2010-01-01,Atlanta,2.73549e+06,Domestic,1,2010,3.6,137.0,7.0,1019.500000
1,2010-01-01,Boston,1.00866e+06,Domestic,1,2010,-1.3,60.0,5.0,1012.000000
2,2010-01-01,Charlotte,1.22159e+06,Domestic,1,2010,3.1,124.0,7.0,1018.300000
3,2010-01-01,Chicago,2.42742e+06,Domestic,1,2010,-5.5,29.0,4.0,1020.000000
4,2010-01-01,Dallas,2.11426e+06,Domestic,1,2010,6.6,72.0,6.0,1020.711111

In [95]:
combined_df2.isna().sum()

ds                  0
city                0
PASSENGERS          0
Type                0
Month               0
Year                0
temperature_mean    0
precipitation       0
rain_days           0
pressure            0
dtype: int64

## Get Cost of Living Index

In [96]:
from bs4 import BeautifulSoup as BS
import urllib.request

In [97]:
years = [2019, 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010]

cost_of_living = []
for year in years:
    url = f'https://www.numbeo.com/cost-of-living/rankings.jsp?title={year}&displayColumn=0'
    resp = urllib.request.urlopen(url)
    soup = BS(resp, from_encoding=resp.info().get_param('charset'))
    table = soup.find_all(class_='cityOrCountryInIndicesTable')
    data = soup.find_all(_='sorting_1')
    for x in soup.find_all(style = 'width: 100%'):
        country = {}
        country['city'] = x.get_text(strip=True).split(',')[0]
        country['cost_of_living_index'] = x.get_text().split()[-1]
        country['year'] = year
        cost_of_living.append(country)

In [98]:
indexes= pd.DataFrame(cost_of_living)
indexes

           city cost_of_living_index  year
0         Basel               131.37  2019
1        Zurich               126.87  2019
2      Lausanne               123.42  2019
3          Bern               123.17  2019
4        Geneva               118.87  2019
...         ...                  ...   ...
3797       Pune                32.55  2010
3798      Delhi                32.43  2010
3799  Hyderabad                32.00  2010
3800    Chennai                31.18  2010
3801  Bangalore                29.82  2010

[3802 rows x 3 columns]

In [99]:
indexes.isna().sum()

city                    0
cost_of_living_index    0
year                    0
dtype: int64

In [100]:
indexes['cost_of_living_index'] = pd.to_numeric(indexes['cost_of_living_index'], errors='coerce')

In [101]:
indexes.head()

       city  cost_of_living_index  year
0     Basel                131.37  2019
1    Zurich                126.87  2019
2  Lausanne                123.42  2019
3      Bern                123.17  2019
4    Geneva                118.87  2019

In [102]:
indexes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3802 entries, 0 to 3801
Data columns (total 3 columns):
city                    3802 non-null object
cost_of_living_index    3802 non-null float64
year                    3802 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 89.2+ KB

In [103]:
indexes[indexes.duplicated(subset=['year', 'city'])]

                  city  cost_of_living_index  year
207             London                 57.09  2019
221           San Jose                 54.50  2019
476           Hamilton                 88.09  2018
567           Portland                 78.45  2018
584          Melbourne                 77.09  2018
617         Burlington                 74.32  2018
655         Birmingham                 71.60  2018
658         Manchester                 71.46  2018
685             London                 69.39  2018
703          Vancouver                 67.79  2018
722          Arlington                 65.63  2018
727           Hamilton                 65.26  2018
747             Athens                 60.55  2018
749           San Jose                 60.46  2018
831   Saint Petersburg                 46.41  2018
1019          Hamilton                 84.02  2017
1044          Portland                 80.60  2017
1046         Melbourne                 80.31  2017
1144            London                 72.21  2017
1153         Vancouver                 71.67  2017
1224          Kingston                 65.41  2017
1229        Birmingham                 64.43  2017
1243          San Jose                 62.22  2017
1253          Hamilton                 61.51  2017
1266            Athens                 58.60  2017
1564          Hamilton                 76.62  2016
1665            Naples                 68.36  2016
1674            London                 67.62  2016
1693         Vancouver                 65.01  2016
1718          San Jose                 60.39  2016
1735          Hamilton                 56.01  2016
2077            London                 83.98  2015
2203          San Jose                 64.55  2015
2580            London                 85.32  2014
2653        Birmingham                 71.18  2014
2662          San Jose                 70.09  2014
2708  Saint Petersburg                 60.85  2014
2994            London                 93.14  2013
3093          San Jose                 70.52  2013
3312            London                 91.51  2012
3372          San Jose                 71.17  2012
3580          San Jose                 76.35  2011

In [104]:
indexes = indexes.sort_values('cost_of_living_index', ascending=False).drop_duplicates(['year','city']).sort_index()

In [105]:
indexes.city.replace('New York', 'New York City', inplace=True)
indexes.city.replace('Split', 'Croatia', inplace=True)
indexes.city.replace('Saint Louis', 'St. Louis', inplace=True)

In [106]:
indexes.year = indexes.year.astype(int)

In [107]:
combined_df3 = combined_df2.merge(indexes, how='left', left_on = ['Year', 'city'], right_on = ['year', 'city'])

In [108]:
combined_df3

,ds,city,PASSENGERS,Type,Month,Year,temperature_mean,precipitation,rain_days,pressure,cost_of_living_index,year
0,2010-01-01,Atlanta,2.73549e+06,Domestic,1,2010,3.6,137.0,7.0,1019.500000,100.99,2010.0
1,2010-01-01,Boston,1.00866e+06,Domestic,1,2010,-1.3,60.0,5.0,1012.000000,89.11,2010.0
2,2010-01-01,Charlotte,1.22159e+06,Domestic,1,2010,3.1,124.0,7.0,1018.300000,NaN,NaN
3,2010-01-01,Chicago,2.42742e+06,Domestic,1,2010,-5.5,29.0,4.0,1020.000000,NaN,NaN
4,2010-01-01,Dallas,2.11426e+06,Domestic,1,2010,6.6,72.0,6.0,1020.711111,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
4791,2018-09-01,Reykjavik,"265,842",International,9,2018,7.1,75.0,15.0,1004.600000,123.78,2018.0
4792,2018-10-01,Reykjavik,"263,587",International,10,2018,3.9,114.0,21.0,998.500000,123.78,2018.0
4793,2018-11-01,Reykjavik,"184,982",International,11,2018,4.2,107.0,9.0,1002.300000,123.78,2018.0
4794,2018-12-01,Reykjavik,"186,853",International,12,2018,2.7,82.0,16.0,998.500000,123.78,2018.0
4795,2019-01-01,Reykjavik,"164,744",International,1,2019,0.5,103.0,18.0,1007.100000,102.20,2019.0

In [109]:
combined_df3.isna().sum()

ds                        0
city                      0
PASSENGERS                0
Type                      0
Month                     0
Year                      0
temperature_mean          0
precipitation             0
rain_days                 0
pressure                  0
cost_of_living_index    588
year                    588
dtype: int64

In [110]:
del combined_df3['year']

In [111]:
combined_df3.sort_values(by='ds', inplace=True)

In [112]:
combined_df3['cost_of_living_index'] = combined_df3.groupby(['city'])['cost_of_living_index'].transform(lambda x: x.fillna(method='ffill'))
combined_df3['cost_of_living_index'] = combined_df3.groupby(['city'])['cost_of_living_index'].transform(lambda x: x.fillna(method='backfill'))

In [113]:
combined_df3['city'] = combined_df3['city'].str.strip()

In [114]:
combined_df3.reset_index(drop=True, inplace=True)

In [115]:
combined_df3

,ds,city,PASSENGERS,Type,Month,Year,temperature_mean,precipitation,rain_days,pressure,cost_of_living_index
0,2010-01-01,Atlanta,2.73549e+06,Domestic,1,2010,3.6,137.0,7.0,1019.50,100.99
1,2010-01-01,Washington,1.92949e+06,Domestic,1,2010,0.4,57.0,8.0,1016.70,98.19
2,2010-01-01,Singapore,"1,681,005",International,1,2010,27.5,70.0,8.0,1011.60,65.94
3,2010-01-01,Berlin,"489,487",International,1,2010,-4.9,21.0,7.0,1014.78,115.24
4,2010-01-01,Paris,"4,154,249",International,1,2010,0.6,36.0,7.0,1015.60,130.30
...,...,...,...,...,...,...,...,...,...,...,...
4791,2019-01-01,San Francisco,2.46216e+06,Domestic,1,2019,12.7,117.0,8.0,1018.20,91.67
4792,2019-01-01,Seattle,1.52515e+06,Domestic,1,2019,7.2,97.0,14.0,1017.90,84.16
4793,2019-01-01,St. Louis,525918,Domestic,1,2019,-0.7,75.0,9.0,1021.70,66.77
4794,2019-01-01,Los Angeles,3.17744e+06,Domestic,1,2019,14.2,140.0,8.0,1018.90,78.20
4795,2019-01-01,Reykjavik,"164,744",International,1,2019,0.5,103.0,18.0,1007.10,102.20

In [116]:
combined_df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4796 entries, 0 to 4795
Data columns (total 11 columns):
ds                      4796 non-null datetime64[ns]
city                    4796 non-null object
PASSENGERS              4796 non-null object
Type                    4796 non-null object
Month                   4796 non-null int64
Year                    4796 non-null int64
temperature_mean        4796 non-null float64
precipitation           4796 non-null float64
rain_days               4796 non-null float64
pressure                4796 non-null float64
cost_of_living_index    4796 non-null float64
dtypes: datetime64[ns](1), float64(5), int64(2), object(3)
memory usage: 412.3+ KB

In [117]:
combined_df3.isna().sum()

ds                      0
city                    0
PASSENGERS              0
Type                    0
Month                   0
Year                    0
temperature_mean        0
precipitation           0
rain_days               0
pressure                0
cost_of_living_index    0
dtype: int64

## Getting population

In [118]:
import re

In [119]:
dom_cities = [city.lower().replace('_','-').replace('.','') for city in dom_cities]
dom_cities

['atlanta',
 'new-york-city',
 'chicago',
 'los-angeles',
 'dallas',
 'washington',
 'san-francisco',
 'denver',
 'houston',
 'miami',
 'phoenix',
 'las-vegas',
 'charlotte',
 'seattle',
 'orlando',
 'boston',
 'minneapolis',
 'detroit',
 'philadelphia',
 'salt-lake-city',
 'san-diego',
 'tampa',
 'portland',
 'honolulu',
 'st-louis']

In [120]:
dom_cities[5] = 'washington-dc'

In [121]:
int_cities = [city.lower().replace('_','-').replace('.','') for city in int_cities]
int_cities

['hong-kong',
 'london',
 'singapore',
 'paris',
 'dubai',
 'kuala-lumpur',
 'phuket',
 'delhi',
 'tokyo',
 'rome',
 'antalya',
 'taipei',
 'amsterdam',
 'seoul',
 'barcelona',
 'berlin',
 'athens',
 'croatia',
 'reykjavik']

In [122]:
pops = []

for city in dom_cities:
    try:
        page1 = requests.get(f'http://worldpopulationreview.com/us-cities/{city}-population/')
        soup1 = BS(page1.content, 'html.parser')
        data = soup1.find(class_ = 'table table-striped').get_text().split('%')
        for y in data[:10]:   
            town = {}
            town['city'] = city
            town['year'] = y.split()[-1][:4]
            town['population'] = re.match('^(\d{1,3}(,\d{3})*)?', y.split()[-1][4:]).group(0)
            print(f'Added {town}')
            pops.append(town)
    except:
        print(f"Couldn't retrieve {city}")
        
for city in int_cities:
    try:
        page1 = requests.get(f'http://worldpopulationreview.com/world-cities/{city}-population/')
        soup1 = BS(page1.content, 'html.parser')
        data = soup1.find(class_ = 'table table-striped').get_text().split('%')
        for y in data[2:10]:   
            town = {}
            town['city'] = city
            new = re.sub('^(\d{1,3}(,\d{3})*)?', '', y.split()[-1])
            town['year'] = new.split()[-1][:4]
            town['population'] = re.match('^(\d{1,3}(,\d{3})*)?', new.split()[-1][4:]).group(0)
            print(f'Added {town}')
            pops.append(town)
    except:
        print(f"Couldn't retrieve {city}")

Added {'city': 'atlanta', 'year': '2018', 'population': '498,044'}
Added {'city': 'atlanta', 'year': '2017', 'population': '491,763'}
Added {'city': 'atlanta', 'year': '2016', 'population': '478,916'}
Added {'city': 'atlanta', 'year': '2015', 'population': '468,707'}
Added {'city': 'atlanta', 'year': '2014', 'population': '460,998'}
Added {'city': 'atlanta', 'year': '2013', 'population': '453,791'}
Added {'city': 'atlanta', 'year': '2012', 'population': '448,799'}
Added {'city': 'atlanta', 'year': '2011', 'population': '437,563'}
Added {'city': 'atlanta', 'year': '2010', 'population': '429,193'}
Added {'city': 'atlanta', 'year': '2000', 'population': '416,474'}
Added {'city': 'new-york-city', 'year': '2018', 'population': '8,398,748'}
Added {'city': 'new-york-city', 'year': '2017', 'population': '8,438,271'}
Added {'city': 'new-york-city', 'year': '2016', 'population': '8,475,976'}
Added {'city': 'new-york-city', 'year': '2015', 'population': '8,468,181'}
Added {'city': 'new-york-city', 'year': '2014', 'population': '8,437,387'}
Added {'city': 'new-york-city', 'year': '2013', 'population': '8,398,739'}
Added {'city': 'new-york-city', 'year': '2012', 'population': '8,348,032'}
Added {'city': 'new-york-city', 'year': '2011', 'population': '8,272,963'}
Added {'city': 'new-york-city', 'year': '2010', 'population': '8,190,355'}
Added {'city': 'new-york-city', 'year': '2000', 'population': '8,008,278'}
Added {'city': 'chicago', 'year': '2018', 'population': '2,705,994'}
Added {'city': 'chicago', 'year': '2017', 'population': '2,713,067'}
Added {'city': 'chicago', 'year': '2016', 'population': '2,718,946'}
Added {'city': 'chicago', 'year': '2015', 'population': '2,726,215'}
Added {'city': 'chicago', 'year': '2014', 'population': '2,728,524'}
Added {'city': 'chicago', 'year': '2013', 'population': '2,726,772'}
Added {'city': 'chicago', 'year': '2012', 'population': '2,719,735'}
Added {'city': 'chicago', 'year': '2011', 'population': '2,708,209'}
Added {'city': 'chicago', 'year': '2010', 'population': '2,697,529'}
Added {'city': 'chicago', 'year': '2000', 'population': '2,896,016'}
Added {'city': 'los-angeles', 'year': '2018', 'population': '3,990,456'}
Added {'city': 'los-angeles', 'year': '2017', 'population': '3,982,002'}
Added {'city': 'los-angeles', 'year': '2016', 'population': '3,969,262'}
Added {'city': 'los-angeles', 'year': '2015', 'population': '3,943,215'}
Added {'city': 'los-angeles', 'year': '2014', 'population': '3,913,260'}
Added {'city': 'los-angeles', 'year': '2013', 'population': '3,883,916'}
Added {'city': 'los-angeles', 'year': '2012', 'population': '3,852,532'}
Added {'city': 'los-angeles', 'year': '2011', 'population': '3,821,136'}
Added {'city': 'los-angeles', 'year': '2010', 'population': '3,795,370'}
Added {'city': 'los-angeles', 'year': '2000', 'population': '3,694,820'}
Added {'city': 'dallas', 'year': '2018', 'population': '1,345,047'}
Added {'city': 'dallas', 'year': '2017', 'population': '1,343,087'}
Added {'city': 'dallas', 'year': '2016', 'population': '1,324,477'}
Added {'city': 'dallas', 'year': '2015', 'population': '1,301,794'}
Added {'city': 'dallas', 'year': '2014', 'population': '1,279,679'}
Added {'city': 'dallas', 'year': '2013', 'population': '1,259,239'}
Added {'city': 'dallas', 'year': '2012', 'population': '1,242,344'}
Added {'city': 'dallas', 'year': '2011', 'population': '1,218,320'}
Added {'city': 'dallas', 'year': '2010', 'population': '1,200,372'}
Added {'city': 'dallas', 'year': '2000', 'population': '1,188,580'}
Added {'city': 'washington-dc', 'year': '2018', 'population': '702,455'}
Added {'city': 'washington-dc', 'year': '2017', 'population': '695,691'}
Added {'city': 'washington-dc', 'year': '2016', 'population': '686,575'}
Added {'city': 'washington-dc', 'year': '2015', 'population': '675,254'}
Added {'city': 'washington-dc', 'year': '2014', 'population': '662,513'}
Added {'city': 'washington-dc', 'year': '2013', 'population': '650,431'}
Added {'city': 'washington-dc', 'year': '2012', 'population': '634,725'}
Added {'city': 'washington-dc', 'year': '2011', 'population': '619,602'}
Added {'city': 'washington-dc', 'year': '2010', 'population': '605,085'}
Added {'city': 'washington-dc', 'year': '2000', 'population': '572,059'}
Added {'city': 'san-francisco', 'year': '2018', 'population': '883,305'}
Added {'city': 'san-francisco', 'year': '2017', 'population': '879,166'}
Added {'city': 'san-francisco', 'year': '2016', 'population': '872,795'}
Added {'city': 'san-francisco', 'year': '2015', 'population': '863,836'}
Added {'city': 'san-francisco', 'year': '2014', 'population': '851,116'}
Added {'city': 'san-francisco', 'year': '2013', 'population': '839,841'}
Added {'city': 'san-francisco', 'year': '2012', 'population': '829,027'}
Added {'city': 'san-francisco', 'year': '2011', 'population': '815,677'}
Added {'city': 'san-francisco', 'year': '2010', 'population': '805,550'}
Added {'city': 'san-francisco', 'year': '2000', 'population': '776,733'}
Added {'city': 'denver', 'year': '2018', 'population': '716,492'}
Added {'city': 'denver', 'year': '2017', 'population': '705,439'}
Added {'city': 'denver', 'year': '2016', 'population': '696,618'}
Added {'city': 'denver', 'year': '2015', 'population': '683,665'}
Added {'city': 'denver', 'year': '2014', 'population': '664,870'}
Added {'city': 'denver', 'year': '2013', 'population': '649,513'}
Added {'city': 'denver', 'year': '2012', 'population': '635,277'}
Added {'city': 'denver', 'year': '2011', 'population': '620,513'}
Added {'city': 'denver', 'year': '2010', 'population': '603,354'}
Added {'city': 'denver', 'year': '2000', 'population': '554,636'}
Added {'city': 'houston', 'year': '2018', 'population': '2,325,502'}
Added {'city': 'houston', 'year': '2017', 'population': '2,317,445'}
Added {'city': 'houston', 'year': '2016', 'population': '2,309,752'}
Added {'city': 'houston', 'year': '2015', 'population': '2,286,630'}
Added {'city': 'houston', 'year': '2014', 'population': '2,240,982'}
Added {'city': 'houston', 'year': '2013', 'population': '2,198,280'}
Added {'city': 'houston', 'year': '2012', 'population': '2,160,086'}
Added {'city': 'houston', 'year': '2011', 'population': '2,124,143'}
Added {'city': 'houston', 'year': '2010', 'population': '2,098,446'}
Added {'city': 'houston', 'year': '2000', 'population': '1,953,631'}
Added {'city': 'miami', 'year': '2018', 'population': '470,914'}
Added {'city': 'miami', 'year': '2017', 'population': '462,030'}
Added {'city': 'miami', 'year': '2016', 'population': '454,293'}
Added {'city': 'miami', 'year': '2015', 'population': '439,404'}
Added {'city': 'miami', 'year': '2014', 'population': '429,365'}
Added {'city': 'miami', 'year': '2013', 'population': '419,829'}
Added {'city': 'miami', 'year': '2012', 'population': '415,270'}
Added {'city': 'miami', 'year': '2011', 'population': '410,673'}
Added {'city': 'miami', 'year': '2010', 'population': '400,841'}
Added {'city': 'miami', 'year': '2000', 'population': '362,470'}
Added {'city': 'phoenix', 'year': '2018', 'population': '1,660,272'}
Added {'city': 'phoenix', 'year': '2017', 'population': '1,634,984'}
Added {'city': 'phoenix', 'year': '2016', 'population': '1,613,581'}
Added {'city': 'phoenix', 'year': '2015', 'population': '1,584,927'}
Added {'city': 'phoenix', 'year': '2014', 'population': '1,556,552'}
Added {'city': 'phoenix', 'year': '2013', 'population': '1,527,336'}
Added {'city': 'phoenix', 'year': '2012', 'population': '1,499,839'}
Added {'city': 'phoenix', 'year': '2011', 'population': '1,470,052'}
Added {'city': 'phoenix', 'year': '2010', 'population': '1,449,295'}
Added {'city': 'phoenix', 'year': '2000', 'population': '1,321,045'}
Added {'city': 'las-vegas', 'year': '2018', 'population': '644,644'}
Added {'city': 'las-vegas', 'year': '2017', 'population': '635,628'}
Added {'city': 'las-vegas', 'year': '2016', 'population': '626,950'}
Added {'city': 'las-vegas', 'year': '2015', 'population': '617,840'}
Added {'city': 'las-vegas', 'year': '2014', 'population': '608,275'}
Added {'city': 'las-vegas', 'year': '2013', 'population': '599,777'}
Added {'city': 'las-vegas', 'year': '2012', 'population': '593,411'}
Added {'city': 'las-vegas', 'year': '2011', 'population': '586,635'}
Added {'city': 'las-vegas', 'year': '2010', 'population': '584,606'}
Added {'city': 'las-vegas', 'year': '2000', 'population': '478,434'}

Added {'city': 'charlotte', 'year': '2018', 'population': '872,498'}
Added {'city': 'charlotte', 'year': '2017', 'population': '859,347'}
Added {'city': 'charlotte', 'year': '2016', 'population': '842,937'}
Added {'city': 'charlotte', 'year': '2015', 'population': '825,733'}
Added {'city': 'charlotte', 'year': '2014', 'population': '807,589'}
Added {'city': 'charlotte', 'year': '2013', 'population': '792,183'}
Added {'city': 'charlotte', 'year': '2012', 'population': '773,336'}
Added {'city': 'charlotte', 'year': '2011', 'population': '754,840'}
Added {'city': 'charlotte', 'year': '2010', 'population': '738,534'}
Added {'city': 'charlotte', 'year': '2000', 'population': '540,828'}
Added {'city': 'seattle', 'year': '2018', 'population': '744,955'}
Added {'city': 'seattle', 'year': '2017', 'population': '729,601'}
Added {'city': 'seattle', 'year': '2016', 'population': '710,510'}
Added {'city': 'seattle', 'year': '2015', 'population': '688,156'}
Added {'city': 'seattle', 'year': '2014', 'population': '670,925'}
Added {'city': 'seattle', 'year': '2013', 'population': '654,224'}
Added {'city': 'seattle', 'year': '2012', 'population': '636,495'}
Added {'city': 'seattle', 'year': '2011', 'population': '623,050'}
Added {'city': 'seattle', 'year': '2010', 'population': '610,639'}
Added {'city': 'seattle', 'year': '2000', 'population': '563,374'}
Added {'city': 'orlando', 'year': '2018', 'population': '285,713'}
Added {'city': 'orlando', 'year': '2017', 'population': '281,143'}
Added {'city': 'orlando', 'year': '2016', 'population': '278,130'}
Added {'city': 'orlando', 'year': '2015', 'population': '270,622'}
Added {'city': 'orlando', 'year': '2014', 'population': '262,507'}
Added {'city': 'orlando', 'year': '2013', 'population': '255,156'}
Added {'city': 'orlando', 'year': '2012', 'population': '249,930'}
Added {'city': 'orlando', 'year': '2011', 'population': '243,585'}
Added {'city': 'orlando', 'year': '2010', 'population': '239,308'}
Added {'city': 'orlando', 'year': '2000', 'population': '185,951'}
Added {'city': 'boston', 'year': '2018', 'population': '694,583'}
Added {'city': 'boston', 'year': '2017', 'population': '688,276'}
Added {'city': 'boston', 'year': '2016', 'population': '680,470'}
Added {'city': 'boston', 'year': '2015', 'population': '670,791'}
Added {'city': 'boston', 'year': '2014', 'population': '663,017'}
Added {'city': 'boston', 'year': '2013', 'population': '653,103'}
Added {'city': 'boston', 'year': '2012', 'population': '643,003'}
Added {'city': 'boston', 'year': '2011', 'population': '630,480'}
Added {'city': 'boston', 'year': '2010', 'population': '621,074'}
Added {'city': 'boston', 'year': '2000', 'population': '589,141'}
Added {'city': 'minneapolis', 'year': '2018', 'population': '425,403'}
Added {'city': 'minneapolis', 'year': '2017', 'population': '421,072'}
Added {'city': 'minneapolis', 'year': '2016', 'population': '415,239'}
Added {'city': 'minneapolis', 'year': '2015', 'population': '411,150'}
Added {'city': 'minneapolis', 'year': '2014', 'population': '407,122'}
Added {'city': 'minneapolis', 'year': '2013', 'population': '400,108'}
Added {'city': 'minneapolis', 'year': '2012', 'population': '392,775'}
Added {'city': 'minneapolis', 'year': '2011', 'population': '388,022'}
Added {'city': 'minneapolis', 'year': '2010', 'population': '383,067'}
Added {'city': 'minneapolis', 'year': '2000', 'population': '382,618'}
Added {'city': 'detroit', 'year': '2018', 'population': '672,662'}
Added {'city': 'detroit', 'year': '2017', 'population': '674,188'}
Added {'city': 'detroit', 'year': '2016', 'population': '676,883'}
Added {'city': 'detroit', 'year': '2015', 'population': '679,305'}
Added {'city': 'detroit', 'year': '2014', 'population': '682,669'}
Added {'city': 'detroit', 'year': '2013', 'population': '691,883'}
Added {'city': 'detroit', 'year': '2012', 'population': '700,159'}
Added {'city': 'detroit', 'year': '2011', 'population': '705,043'}
Added {'city': 'detroit', 'year': '2010', 'population': '711,120'}
Added {'city': 'detroit', 'year': '2000', 'population': '951,270'}
Added {'city': 'philadelphia', 'year': '2018', 'population': '1,584,138'}
Added {'city': 'philadelphia', 'year': '2017', 'population': '1,580,221'}
Added {'city': 'philadelphia', 'year': '2016', 'population': '1,576,390'}
Added {'city': 'philadelphia', 'year': '2015', 'population': '1,571,258'}
Added {'city': 'philadelphia', 'year': '2014', 'population': '1,565,604'}
Added {'city': 'philadelphia', 'year': '2013', 'population': '1,558,371'}
Added {'city': 'philadelphia', 'year': '2012', 'population': '1,551,797'}
Added {'city': 'philadelphia', 'year': '2011', 'population': '1,540,322'}
Added {'city': 'philadelphia', 'year': '2010', 'population': '1,528,293'}
Added {'city': 'philadelphia', 'year': '2000', 'population': '1,517,550'}
Added {'city': 'salt-lake-city', 'year': '2018', 'population': '200,591'}
Added {'city': 'salt-lake-city', 'year': '2017', 'population': '200,570'}
Added {'city': 'salt-lake-city', 'year': '2016', 'population': '194,182'}
Added {'city': 'salt-lake-city', 'year': '2015', 'population': '191,737'}
Added {'city': 'salt-lake-city', 'year': '2014', 'population': '191,398'}
Added {'city': 'salt-lake-city', 'year': '2013', 'population': '191,661'}
Added {'city': 'salt-lake-city', 'year': '2012', 'population': '189,715'}
Added {'city': 'salt-lake-city', 'year': '2011', 'population': '188,181'}
Added {'city': 'salt-lake-city', 'year': '2010', 'population': '186,571'}
Added {'city': 'salt-lake-city', 'year': '2000', 'population': '181,743'}
Added {'city': 'san-diego', 'year': '2018', 'population': '1,425,976'}
Added {'city': 'san-diego', 'year': '2017', 'population': '1,414,427'}
Added {'city': 'san-diego', 'year': '2016', 'population': '1,403,865'}
Added {'city': 'san-diego', 'year': '2015', 'population': '1,388,674'}
Added {'city': 'san-diego', 'year': '2014', 'population': '1,376,725'}
Added {'city': 'san-diego', 'year': '2013', 'population': '1,355,951'}
Added {'city': 'san-diego', 'year': '2012', 'population': '1,337,149'}
Added {'city': 'san-diego', 'year': '2011', 'population': '1,319,697'}
Added {'city': 'san-diego', 'year': '2010', 'population': '1,305,970'}
Added {'city': 'san-diego', 'year': '2000', 'population': '1,223,400'}
Added {'city': 'tampa', 'year': '2018', 'population': '392,890'}
Added {'city': 'tampa', 'year': '2017', 'population': '386,577'}
Added {'city': 'tampa', 'year': '2016', 'population': '376,170'}
Added {'city': 'tampa', 'year': '2015', 'population': '367,413'}
Added {'city': 'tampa', 'year': '2014', 'population': '358,754'}
Added {'city': 'tampa', 'year': '2013', 'population': '352,426'}
Added {'city': 'tampa', 'year': '2012', 'population': '348,655'}
Added {'city': 'tampa', 'year': '2011', 'population': '346,778'}
Added {'city': 'tampa', 'year': '2010', 'population': '337,062'}
Added {'city': 'tampa', 'year': '2000', 'population': '303,447'}
Added {'city': 'portland', 'year': '2018', 'population': '653,115'}
Added {'city': 'portland', 'year': '2017', 'population': '648,630'}
Added {'city': 'portland', 'year': '2016', 'population': '643,136'}
Added {'city': 'portland', 'year': '2015', 'population': '631,539'}
Added {'city': 'portland', 'year': '2014', 'population': '620,647'}
Added {'city': 'portland', 'year': '2013', 'population': '609,970'}
Added {'city': 'portland', 'year': '2012', 'population': '604,285'}
Added {'city': 'portland', 'year': '2011', 'population': '595,410'}
Added {'city': 'portland', 'year': '2010', 'population': '585,436'}
Added {'city': 'portland', 'year': '2000', 'population': '529,121'}
Added {'city': 'honolulu', 'year': '2018', 'population': '347,397'}
Added {'city': 'honolulu', 'year': '2017', 'population': '349,651'}
Added {'city': 'honolulu', 'year': '2016', 'population': '351,883'}
Added {'city': 'honolulu', 'year': '2015', 'population': '351,684'}
Added {'city': 'honolulu', 'year': '2014', 'population': '349,627'}
Added {'city': 'honolulu', 'year': '2013', 'population': '349,275'}
Added {'city': 'honolulu', 'year': '2012', 'population': '346,868'}
Added {'city': 'honolulu', 'year': '2011', 'population': '343,040'}
Added {'city': 'honolulu', 'year': '2010', 'population': '339,143'}
Added {'city': 'honolulu', 'year': '2000', 'population': '371,657'}

Added {'city': 'st-louis', 'year': '2018', 'population': '302,838'}
Added {'city': 'st-louis', 'year': '2017', 'population': '307,866'}
Added {'city': 'st-louis', 'year': '2016', 'population': '312,389'}
Added {'city': 'st-louis', 'year': '2015', 'population': '315,878'}
Added {'city': 'st-louis', 'year': '2014', 'population': '317,395'}
Added {'city': 'st-louis', 'year': '2013', 'population': '318,459'}
Added {'city': 'st-louis', 'year': '2012', 'population': '319,387'}
Added {'city': 'st-louis', 'year': '2011', 'population': '319,294'}
Added {'city': 'st-louis', 'year': '2010', 'population': '319,318'}
Added {'city': 'st-louis', 'year': '2000', 'population': '348,189'}
Added {'city': 'hong-kong', 'year': '2030', 'population': '7,987,249'}
Added {'city': 'hong-kong', 'year': '2025', 'population': '7,768,510'}
Added {'city': 'hong-kong', 'year': '2020', 'population': '7,547,652'}
Added {'city': 'hong-kong', 'year': '2015', 'population': '7,245,701'}
Added {'city': 'hong-kong', 'year': '2010', 'population': '7,025,221'}
Added {'city': 'hong-kong', 'year': '2005', 'population': '6,827,761'}
Added {'city': 'hong-kong', 'year': '2000', 'population': '6,663,654'}
Added {'city': 'hong-kong', 'year': '1995', 'population': '6,140,101'}
Added {'city': 'london', 'year': '2030', 'population': '10,228,051'}
Added {'city': 'london', 'year': '2025', 'population': '9,840,742'}
Added {'city': 'london', 'year': '2020', 'population': '9,304,016'}
Added {'city': 'london', 'year': '2015', 'population': '8,661,381'}
Added {'city': 'london', 'year': '2010', 'population': '8,044,433'}
Added {'city': 'london', 'year': '2005', 'population': '7,501,217'}
Added {'city': 'london', 'year': '2000', 'population': '7,272,819'}
Added {'city': 'london', 'year': '1995', 'population': '7,029,508'}
Added {'city': 'singapore', 'year': '2030', 'population': '6,342,470'}
Added {'city': 'singapore', 'year': '2025', 'population': '6,157,267'}
Added {'city': 'singapore', 'year': '2020', 'population': '5,935,053'}
Added {'city': 'singapore', 'year': '2015', 'population': '5,535,262'}
Added {'city': 'singapore', 'year': '2010', 'population': '5,074,252'}
Added {'city': 'singapore', 'year': '2005', 'population': '4,491,042'}
Added {'city': 'singapore', 'year': '2000', 'population': '3,913,960'}
Added {'city': 'singapore', 'year': '1995', 'population': '3,478,779'}
Added {'city': 'paris', 'year': '2030', 'population': '11,709,788'}
Added {'city': 'paris', 'year': '2025', 'population': '11,346,802'}
Added {'city': 'paris', 'year': '2020', 'population': '11,017,230'}
Added {'city': 'paris', 'year': '2015', 'population': '10,733,502'}
Added {'city': 'paris', 'year': '2010', 'population': '10,460,118'}
Added {'city': 'paris', 'year': '2005', 'population': '10,091,795'}
Added {'city': 'paris', 'year': '2000', 'population': '9,736,538'}
Added {'city': 'paris', 'year': '1995', 'population': '9,510,103'}
Added {'city': 'dubai', 'year': '2030', 'population': '3,314,985'}
Added {'city': 'dubai', 'year': '2025', 'population': '3,094,643'}
Added {'city': 'dubai', 'year': '2020', 'population': '2,878,344'}
Added {'city': 'dubai', 'year': '2015', 'population': '2,401,067'}
Added {'city': 'dubai', 'year': '2010', 'population': '1,874,729'}
Added {'city': 'dubai', 'year': '2005', 'population': '1,267,755'}
Added {'city': 'dubai', 'year': '2000', 'population': '906,971'}
Added {'city': 'dubai', 'year': '1995', 'population': '649,755'}
Added {'city': 'kuala-lumpur', 'year': '2030', 'population': '9,805,249'}
Added {'city': 'kuala-lumpur', 'year': '2025', 'population': '9,000,280'}
Added {'city': 'kuala-lumpur', 'year': '2020', 'population': '7,996,830'}
Added {'city': 'kuala-lumpur', 'year': '2015', 'population': '6,851,431'}
Added {'city': 'kuala-lumpur', 'year': '2010', 'population': '5,809,953'}
Added {'city': 'kuala-lumpur', 'year': '2005', 'population': '4,926,787'}
Added {'city': 'kuala-lumpur', 'year': '2000', 'population': '4,176,469'}
Added {'city': 'kuala-lumpur', 'year': '1995', 'population': '2,974,961'}
Added {'city': 'phuket', 'year': '2030', 'population': '488,325'}
Added {'city': 'phuket', 'year': '2025', 'population': '460,810'}
Added {'city': 'phuket', 'year': '2020', 'population': '432,216'}
Added {'city': 'phuket', 'year': '2015', 'population': '395,436'}
Added {'city': 'phuket', 'year': '2010', 'population': '350,272'}
Added {'city': 'phuket', 'year': '2005', 'population': '181,870'}
Added {'city': 'phuket', 'year': '2000', 'population': '94,449'}
Added {'city': 'phuket', 'year': '1995', 'population': '77,305'}
Added {'city': 'delhi', 'year': '2030', 'population': '38,938,697'}
Added {'city': 'delhi', 'year': '2025', 'population': '34,665,569'}
Added {'city': 'delhi', 'year': '2020', 'population': '30,290,936'}
Added {'city': 'delhi', 'year': '2015', 'population': '25,865,875'}
Added {'city': 'delhi', 'year': '2010', 'population': '21,987,895'}
Added {'city': 'delhi', 'year': '2005', 'population': '18,691,330'}
Added {'city': 'delhi', 'year': '2000', 'population': '15,691,899'}
Added {'city': 'delhi', 'year': '1995', 'population': '12,138,233'}
Added {'city': 'tokyo', 'year': '-559', 'population': ''}
Added {'city': 'tokyo', 'year': '-462', 'population': ''}
Added {'city': 'tokyo', 'year': '-356', 'population': ''}
Added {'city': 'tokyo', 'year': '2015', 'population': '37,256,109'}
Added {'city': 'tokyo', 'year': '2010', 'population': '36,859,626'}
Added {'city': 'tokyo', 'year': '2005', 'population': '35,621,544'}
Added {'city': 'tokyo', 'year': '2000', 'population': '34,449,908'}
Added {'city': 'tokyo', 'year': '1995', 'population': '33,586,573'}
Added {'city': 'rome', 'year': '2030', 'population': '4,413,285'}
Added {'city': 'rome', 'year': '2025', 'population': '4,347,104'}
Added {'city': 'rome', 'year': '2020', 'population': '4,257,056'}
Added {'city': 'rome', 'year': '2015', 'population': '4,113,185'}
Added {'city': 'rome', 'year': '2010', 'population': '3,957,247'}
Added {'city': 'rome', 'year': '2005', 'population': '3,807,383'}
Added {'city': 'rome', 'year': '2000', 'population': '3,708,301'}
Added {'city': 'rome', 'year': '-30,', 'population': '271'}
Added {'city': 'antalya', 'year': '2030', 'population': '1,480,997'}
Added {'city': 'antalya', 'year': '2025', 'population': '1,394,593'}
Added {'city': 'antalya', 'year': '2020', 'population': '1,253,872'}
Added {'city': 'antalya', 'year': '2015', 'population': '1,083,923'}
Added {'city': 'antalya', 'year': '2010', 'population': '905,952'}
Added {'city': 'antalya', 'year': '2005', 'population': '734,434'}
Added {'city': 'antalya', 'year': '2000', 'population': '594,562'}
Added {'city': 'antalya', 'year': '1995', 'population': '470,805'}
Couldn't retrieve taipei
Added {'city': 'amsterdam', 'year': '2030', 'population': '1,218,918'}
Added {'city': 'amsterdam', 'year': '2025', 'population': '1,189,205'}
Added {'city': 'amsterdam', 'year': '2020', 'population': '1,148,972'}
Added {'city': 'amsterdam', 'year': '2015', 'population': '1,106,056'}
Added {'city': 'amsterdam', 'year': '2010', 'population': '1,064,617'}
Added {'city': 'amsterdam', 'year': '2005', 'population': '1,024,731'}
Added {'city': 'amsterdam', 'year': '2000', 'population': '1,004,643'}
Added {'city': 'amsterdam', 'year': '1995', 'population': '987,823'}
Added {'city': 'seoul', 'year': '2030', 'population': '10,163,143'}
Added {'city': 'seoul', 'year': '2025', 'population': '10,025,770'}
Added {'city': 'seoul', 'year': '2020', 'population': '9,963,452'}
Added {'city': 'seoul', 'year': '2015', 'population': '9,896,859'}
Added {'city': 'seoul', 'year': '2010', 'population': '9,796,045'}
Added {'city': 'seoul', 'year': '-26,', 'population': '402'}
Added {'city': 'seoul', 'year': '-56,', 'population': '626'}
Added {'city': 'seoul', 'year': '-376', 'population': ''}
Added {'city': 'barcelona', 'year': '2030', 'population': '5,811,896'}
Added {'city': 'barcelona', 'year': '2025', 'population': '5,733,247'}
Added {'city': 'barcelona', 'year': '2020', 'population': '5,585,556'}
Added {'city': 'barcelona', 'year': '2015', 'population': '5,276,919'}
Added {'city': 'barcelona', 'year': '2010', 'population': '4,933,548'}
Added {'city': 'barcelona', 'year': '2005', 'population': '4,612,350'}
Added {'city': 'barcelona', 'year': '2000', 'population': '4,355,425'}
Added {'city': 'barcelona', 'year': '1995', 'population': '4,226,951'}

Added {'city': 'berlin', 'year': '2030', 'population': '3,606,268'}
Added {'city': 'berlin', 'year': '2025', 'population': '3,580,188'}
Added {'city': 'berlin', 'year': '2020', 'population': '3,562,038'}
Added {'city': 'berlin', 'year': '2015', 'population': '3,513,595'}
Added {'city': 'berlin', 'year': '2010', 'population': '3,450,395'}
Added {'city': 'berlin', 'year': '2005', 'population': '3,391,496'}
Added {'city': 'berlin', 'year': '2000', 'population': '3,384,417'}
Added {'city': 'berlin', 'year': '-86,', 'population': '978'}
Added {'city': 'athens', 'year': '2030', 'population': '3,163,463'}
Added {'city': 'athens', 'year': '2025', 'population': '3,155,318'}
Added {'city': 'athens', 'year': '2020', 'population': '3,153,355'}
Added {'city': 'athens', 'year': '-7,8', 'population': '002'}
Added {'city': 'athens', 'year': '-9,2', 'population': '792'}
Added {'city': 'athens', 'year': '-9,3', 'population': '022'}
Added {'city': 'athens', 'year': '2000', 'population': '3,179,434'}
Added {'city': 'athens', 'year': '1995', 'population': '3,121,652'}
Couldn't retrieve croatia
Couldn't retrieve reykjavik

In [123]:
pops.append({'city': 'taipei', 'year': '2019', 'population': '7871900'})

In [124]:
pops.append({'city': 'zagreb', 'year': '2019', 'population': '798966'})

In [125]:
pops.append({'city': 'reykjavik', 'year': '2019', 'population': '340235'})

In [126]:
pops.append({'city': 'athens', 'year': '2019', 'population': '3179434'})

In [127]:
del pops[-8:-5]

In [128]:
pops

[{'city': 'atlanta', 'year': '2018', 'population': '498,044'},
 {'city': 'atlanta', 'year': '2017', 'population': '491,763'},
 {'city': 'atlanta', 'year': '2016', 'population': '478,916'},
 {'city': 'atlanta', 'year': '2015', 'population': '468,707'},
 {'city': 'atlanta', 'year': '2014', 'population': '460,998'},
 {'city': 'atlanta', 'year': '2013', 'population': '453,791'},
 {'city': 'atlanta', 'year': '2012', 'population': '448,799'},
 {'city': 'atlanta', 'year': '2011', 'population': '437,563'},
 {'city': 'atlanta', 'year': '2010', 'population': '429,193'},
 {'city': 'atlanta', 'year': '2000', 'population': '416,474'},
 {'city': 'new-york-city', 'year': '2018', 'population': '8,398,748'},
 {'city': 'new-york-city', 'year': '2017', 'population': '8,438,271'},
 {'city': 'new-york-city', 'year': '2016', 'population': '8,475,976'},
 {'city': 'new-york-city', 'year': '2015', 'population': '8,468,181'},
 {'city': 'new-york-city', 'year': '2014', 'population': '8,437,387'},
 {'city': 'new-york-city', 'year': '2013', 'population': '8,398,739'},
 {'city': 'new-york-city', 'year': '2012', 'population': '8,348,032'},
 {'city': 'new-york-city', 'year': '2011', 'population': '8,272,963'},
 {'city': 'new-york-city', 'year': '2010', 'population': '8,190,355'},
 {'city': 'new-york-city', 'year': '2000', 'population': '8,008,278'},
 {'city': 'chicago', 'year': '2018', 'population': '2,705,994'},
 {'city': 'chicago', 'year': '2017', 'population': '2,713,067'},
 {'city': 'chicago', 'year': '2016', 'population': '2,718,946'},
 {'city': 'chicago', 'year': '2015', 'population': '2,726,215'},
 {'city': 'chicago', 'year': '2014', 'population': '2,728,524'},
 {'city': 'chicago', 'year': '2013', 'population': '2,726,772'},
 {'city': 'chicago', 'year': '2012', 'population': '2,719,735'},
 {'city': 'chicago', 'year': '2011', 'population': '2,708,209'},
 {'city': 'chicago', 'year': '2010', 'population': '2,697,529'},
 {'city': 'chicago', 'year': '2000', 'population': '2,896,016'},
 {'city': 'los-angeles', 'year': '2018', 'population': '3,990,456'},
 {'city': 'los-angeles', 'year': '2017', 'population': '3,982,002'},
 {'city': 'los-angeles', 'year': '2016', 'population': '3,969,262'},
 {'city': 'los-angeles', 'year': '2015', 'population': '3,943,215'},
 {'city': 'los-angeles', 'year': '2014', 'population': '3,913,260'},
 {'city': 'los-angeles', 'year': '2013', 'population': '3,883,916'},
 {'city': 'los-angeles', 'year': '2012', 'population': '3,852,532'},
 {'city': 'los-angeles', 'year': '2011', 'population': '3,821,136'},
 {'city': 'los-angeles', 'year': '2010', 'population': '3,795,370'},
 {'city': 'los-angeles', 'year': '2000', 'population': '3,694,820'},
 {'city': 'dallas', 'year': '2018', 'population': '1,345,047'},
 {'city': 'dallas', 'year': '2017', 'population': '1,343,087'},
 {'city': 'dallas', 'year': '2016', 'population': '1,324,477'},
 {'city': 'dallas', 'year': '2015', 'population': '1,301,794'},
 {'city': 'dallas', 'year': '2014', 'population': '1,279,679'},
 {'city': 'dallas', 'year': '2013', 'population': '1,259,239'},
 {'city': 'dallas', 'year': '2012', 'population': '1,242,344'},
 {'city': 'dallas', 'year': '2011', 'population': '1,218,320'},
 {'city': 'dallas', 'year': '2010', 'population': '1,200,372'},
 {'city': 'dallas', 'year': '2000', 'population': '1,188,580'},
 {'city': 'washington-dc', 'year': '2018', 'population': '702,455'},
 {'city': 'washington-dc', 'year': '2017', 'population': '695,691'},
 {'city': 'washington-dc', 'year': '2016', 'population': '686,575'},
 {'city': 'washington-dc', 'year': '2015', 'population': '675,254'},
 {'city': 'washington-dc', 'year': '2014', 'population': '662,513'},
 {'city': 'washington-dc', 'year': '2013', 'population': '650,431'},
 {'city': 'washington-dc', 'year': '2012', 'population': '634,725'},
 {'city': 'washington-dc', 'year': '2011', 'population': '619,602'},
 {'city': 'washington-dc', 'year': '2010', 'population': '605,085'},
 {'city': 'washington-dc', 'year': '2000', 'population': '572,059'},
 {'city': 'san-francisco', 'year': '2018', 'population': '883,305'},
 {'city': 'san-francisco', 'year': '2017', 'population': '879,166'},
 {'city': 'san-francisco', 'year': '2016', 'population': '872,795'},
 {'city': 'san-francisco', 'year': '2015', 'population': '863,836'},
 {'city': 'san-francisco', 'year': '2014', 'population': '851,116'},
 {'city': 'san-francisco', 'year': '2013', 'population': '839,841'},
 {'city': 'san-francisco', 'year': '2012', 'population': '829,027'},
 {'city': 'san-francisco', 'year': '2011', 'population': '815,677'},
 {'city': 'san-francisco', 'year': '2010', 'population': '805,550'},
 {'city': 'san-francisco', 'year': '2000', 'population': '776,733'},
 {'city': 'denver', 'year': '2018', 'population': '716,492'},
 {'city': 'denver', 'year': '2017', 'population': '705,439'},
 {'city': 'denver', 'year': '2016', 'population': '696,618'},
 {'city': 'denver', 'year': '2015', 'population': '683,665'},
 {'city': 'denver', 'year': '2014', 'population': '664,870'},
 {'city': 'denver', 'year': '2013', 'population': '649,513'},
 {'city': 'denver', 'year': '2012', 'population': '635,277'},
 {'city': 'denver', 'year': '2011', 'population': '620,513'},
 {'city': 'denver', 'year': '2010', 'population': '603,354'},
 {'city': 'denver', 'year': '2000', 'population': '554,636'},
 {'city': 'houston', 'year': '2018', 'population': '2,325,502'},
 {'city': 'houston', 'year': '2017', 'population': '2,317,445'},
 {'city': 'houston', 'year': '2016', 'population': '2,309,752'},
 {'city': 'houston', 'year': '2015', 'population': '2,286,630'},
 {'city': 'houston', 'year': '2014', 'population': '2,240,982'},
 {'city': 'houston', 'year': '2013', 'population': '2,198,280'},
 {'city': 'houston', 'year': '2012', 'population': '2,160,086'},
 {'city': 'houston', 'year': '2011', 'population': '2,124,143'},
 {'city': 'houston', 'year': '2010', 'population': '2,098,446'},
 {'city': 'houston', 'year': '2000', 'population': '1,953,631'},
 {'city': 'miami', 'year': '2018', 'population': '470,914'},
 {'city': 'miami', 'year': '2017', 'population': '462,030'},
 {'city': 'miami', 'year': '2016', 'population': '454,293'},
 {'city': 'miami', 'year': '2015', 'population': '439,404'},
 {'city': 'miami', 'year': '2014', 'population': '429,365'},
 {'city': 'miami', 'year': '2013', 'population': '419,829'},
 {'city': 'miami', 'year': '2012', 'population': '415,270'},
 {'city': 'miami', 'year': '2011', 'population': '410,673'},
 {'city': 'miami', 'year': '2010', 'population': '400,841'},
 {'city': 'miami', 'year': '2000', 'population': '362,470'},
 {'city': 'phoenix', 'year': '2018', 'population': '1,660,272'},
 {'city': 'phoenix', 'year': '2017', 'population': '1,634,984'},
 {'city': 'phoenix', 'year': '2016', 'population': '1,613,581'},
 {'city': 'phoenix', 'year': '2015', 'population': '1,584,927'},
 {'city': 'phoenix', 'year': '2014', 'population': '1,556,552'},
 {'city': 'phoenix', 'year': '2013', 'population': '1,527,336'},
 {'city': 'phoenix', 'year': '2012', 'population': '1,499,839'},
 {'city': 'phoenix', 'year': '2011', 'population': '1,470,052'},
 {'city': 'phoenix', 'year': '2010', 'population': '1,449,295'},
 {'city': 'phoenix', 'year': '2000', 'population': '1,321,045'},
 {'city': 'las-vegas', 'year': '2018', 'population': '644,644'},
 {'city': 'las-vegas', 'year': '2017', 'population': '635,628'},
 {'city': 'las-vegas', 'year': '2016', 'population': '626,950'},
 {'city': 'las-vegas', 'year': '2015', 'population': '617,840'},
 {'city': 'las-vegas', 'year': '2014', 'population': '608,275'},
 {'city': 'las-vegas', 'year': '2013', 'population': '599,777'},
 {'city': 'las-vegas', 'year': '2012', 'population': '593,411'},
 {'city': 'las-vegas', 'year': '2011', 'population': '586,635'},
 {'city': 'las-vegas', 'year': '2010', 'population': '584,606'},
 {'city': 'las-vegas', 'year': '2000', 'population': '478,434'},
 {'city': 'charlotte', 'year': '2018', 'population': '872,498'},
 {'city': 'charlotte', 'year': '2017', 'population': '859,347'},
 {'city': 'charlotte', 'year': '2016', 'population': '842,937'},
 {'city': 'charlotte', 'year': '2015', 'population': '825,733'},
 {'city': 'charlotte', 'year': '2014', 'population': '807,589'},
 {'city': 'charlotte', 'year': '2013', 'population': '792,183'},
 {'city': 'charlotte', 'year': '2012', 'population': '773,336'},
 {'city': 'charlotte', 'year': '2011', 'population': '754,840'},
 {'city': 'charlotte', 'year': '2010', 'population': '738,534'},
 {'city': 'charlotte', 'year': '2000', 'population': '540,828'},
 {'city': 'seattle', 'year': '2018', 'population': '744,955'},
 {'city': 'seattle', 'year': '2017', 'population': '729,601'},
 {'city': 'seattle', 'year': '2016', 'population': '710,510'},
 {'city': 'seattle', 'year': '2015', 'population': '688,156'},
 {'city': 'seattle', 'year': '2014', 'population': '670,925'},
 {'city': 'seattle', 'year': '2013', 'population': '654,224'},
 {'city': 'seattle', 'year': '2012', 'population': '636,495'},
 {'city': 'seattle', 'year': '2011', 'population': '623,050'},
 {'city': 'seattle', 'year': '2010', 'population': '610,639'},
 {'city': 'seattle', 'year': '2000', 'population': '563,374'},
 {'city': 'orlando', 'year': '2018', 'population': '285,713'},
 {'city': 'orlando', 'year': '2017', 'population': '281,143'},
 {'city': 'orlando', 'year': '2016', 'population': '278,130'},
 {'city': 'orlando', 'year': '2015', 'population': '270,622'},
 {'city': 'orlando', 'year': '2014', 'population': '262,507'},
 {'city': 'orlando', 'year': '2013', 'population': '255,156'},
 {'city': 'orlando', 'year': '2012', 'population': '249,930'},
 {'city': 'orlando', 'year': '2011', 'population': '243,585'},
 {'city': 'orlando', 'year': '2010', 'population': '239,308'},
 {'city': 'orlando', 'year': '2000', 'population': '185,951'},
 {'city': 'boston', 'year': '2018', 'population': '694,583'},
 {'city': 'boston', 'year': '2017', 'population': '688,276'},
 {'city': 'boston', 'year': '2016', 'population': '680,470'},
 {'city': 'boston', 'year': '2015', 'population': '670,791'},
 {'city': 'boston', 'year': '2014', 'population': '663,017'},
 {'city': 'boston', 'year': '2013', 'population': '653,103'},
 {'city': 'boston', 'year': '2012', 'population': '643,003'},
 {'city': 'boston', 'year': '2011', 'population': '630,480'},
 {'city': 'boston', 'year': '2010', 'population': '621,074'},
 {'city': 'boston', 'year': '2000', 'population': '589,141'},
 {'city': 'minneapolis', 'year': '2018', 'population': '425,403'},
 {'city': 'minneapolis', 'year': '2017', 'population': '421,072'},
 {'city': 'minneapolis', 'year': '2016', 'population': '415,239'},
 {'city': 'minneapolis', 'year': '2015', 'population': '411,150'},
 {'city': 'minneapolis', 'year': '2014', 'population': '407,122'},
 {'city': 'minneapolis', 'year': '2013', 'population': '400,108'},
 {'city': 'minneapolis', 'year': '2012', 'population': '392,775'},
 {'city': 'minneapolis', 'year': '2011', 'population': '388,022'},
 {'city': 'minneapolis', 'year': '2010', 'population': '383,067'},
 {'city': 'minneapolis', 'year': '2000', 'population': '382,618'},
 {'city': 'detroit', 'year': '2018', 'population': '672,662'},
 {'city': 'detroit', 'year': '2017', 'population': '674,188'},
 {'city': 'detroit', 'year': '2016', 'population': '676,883'},
 {'city': 'detroit', 'year': '2015', 'population': '679,305'},
 {'city': 'detroit', 'year': '2014', 'population': '682,669'},
 {'city': 'detroit', 'year': '2013', 'population': '691,883'},
 {'city': 'detroit', 'year': '2012', 'population': '700,159'},
 {'city': 'detroit', 'year': '2011', 'population': '705,043'},
 {'city': 'detroit', 'year': '2010', 'population': '711,120'},
 {'city': 'detroit', 'year': '2000', 'population': '951,270'},
 {'city': 'philadelphia', 'year': '2018', 'population': '1,584,138'},
 {'city': 'philadelphia', 'year': '2017', 'population': '1,580,221'},
 {'city': 'philadelphia', 'year': '2016', 'population': '1,576,390'},
 {'city': 'philadelphia', 'year': '2015', 'population': '1,571,258'},
 {'city': 'philadelphia', 'year': '2014', 'population': '1,565,604'},
 {'city': 'philadelphia', 'year': '2013', 'population': '1,558,371'},
 {'city': 'philadelphia', 'year': '2012', 'population': '1,551,797'},
 {'city': 'philadelphia', 'year': '2011', 'population': '1,540,322'},
 {'city': 'philadelphia', 'year': '2010', 'population': '1,528,293'},
 {'city': 'philadelphia', 'year': '2000', 'population': '1,517,550'},
 {'city': 'salt-lake-city', 'year': '2018', 'population': '200,591'},
 {'city': 'salt-lake-city', 'year': '2017', 'population': '200,570'},
 {'city': 'salt-lake-city', 'year': '2016', 'population': '194,182'},
 {'city': 'salt-lake-city', 'year': '2015', 'population': '191,737'},
 {'city': 'salt-lake-city', 'year': '2014', 'population': '191,398'},
 {'city': 'salt-lake-city', 'year': '2013', 'population': '191,661'},
 {'city': 'salt-lake-city', 'year': '2012', 'population': '189,715'},
 {'city': 'salt-lake-city', 'year': '2011', 'population': '188,181'},
 {'city': 'salt-lake-city', 'year': '2010', 'population': '186,571'},
 {'city': 'salt-lake-city', 'year': '2000', 'population': '181,743'},
 {'city': 'san-diego', 'year': '2018', 'population': '1,425,976'},
 {'city': 'san-diego', 'year': '2017', 'population': '1,414,427'},
 {'city': 'san-diego', 'year': '2016', 'population': '1,403,865'},
 {'city': 'san-diego', 'year': '2015', 'population': '1,388,674'},
 {'city': 'san-diego', 'year': '2014', 'population': '1,376,725'},
 {'city': 'san-diego', 'year': '2013', 'population': '1,355,951'},
 {'city': 'san-diego', 'year': '2012', 'population': '1,337,149'},
 {'city': 'san-diego', 'year': '2011', 'population': '1,319,697'},
 {'city': 'san-diego', 'year': '2010', 'population': '1,305,970'},
 {'city': 'san-diego', 'year': '2000', 'population': '1,223,400'},
 {'city': 'tampa', 'year': '2018', 'population': '392,890'},
 {'city': 'tampa', 'year': '2017', 'population': '386,577'},
 {'city': 'tampa', 'year': '2016', 'population': '376,170'},
 {'city': 'tampa', 'year': '2015', 'population': '367,413'},
 {'city': 'tampa', 'year': '2014', 'population': '358,754'},
 {'city': 'tampa', 'year': '2013', 'population': '352,426'},
 {'city': 'tampa', 'year': '2012', 'population': '348,655'},
 {'city': 'tampa', 'year': '2011', 'population': '346,778'},
 {'city': 'tampa', 'year': '2010', 'population': '337,062'},
 {'city': 'tampa', 'year': '2000', 'population': '303,447'},
 {'city': 'portland', 'year': '2018', 'population': '653,115'},
 {'city': 'portland', 'year': '2017', 'population': '648,630'},
 {'city': 'portland', 'year': '2016', 'population': '643,136'},
 {'city': 'portland', 'year': '2015', 'population': '631,539'},
 {'city': 'portland', 'year': '2014', 'population': '620,647'},
 {'city': 'portland', 'year': '2013', 'population': '609,970'},
 {'city': 'portland', 'year': '2012', 'population': '604,285'},
 {'city': 'portland', 'year': '2011', 'population': '595,410'},
 {'city': 'portland', 'year': '2010', 'population': '585,436'},
 {'city': 'portland', 'year': '2000', 'population': '529,121'},
 {'city': 'honolulu', 'year': '2018', 'population': '347,397'},
 {'city': 'honolulu', 'year': '2017', 'population': '349,651'},
 {'city': 'honolulu', 'year': '2016', 'population': '351,883'},
 {'city': 'honolulu', 'year': '2015', 'population': '351,684'},
 {'city': 'honolulu', 'year': '2014', 'population': '349,627'},
 {'city': 'honolulu', 'year': '2013', 'population': '349,275'},
 {'city': 'honolulu', 'year': '2012', 'population': '346,868'},
 {'city': 'honolulu', 'year': '2011', 'population': '343,040'},
 {'city': 'honolulu', 'year': '2010', 'population': '339,143'},
 {'city': 'honolulu', 'year': '2000', 'population': '371,657'},
 {'city': 'st-louis', 'year': '2018', 'population': '302,838'},
 {'city': 'st-louis', 'year': '2017', 'population': '307,866'},
 {'city': 'st-louis', 'year': '2016', 'population': '312,389'},
 {'city': 'st-louis', 'year': '2015', 'population': '315,878'},
 {'city': 'st-louis', 'year': '2014', 'population': '317,395'},
 {'city': 'st-louis', 'year': '2013', 'population': '318,459'},
 {'city': 'st-louis', 'year': '2012', 'population': '319,387'},
 {'city': 'st-louis', 'year': '2011', 'population': '319,294'},
 {'city': 'st-louis', 'year': '2010', 'population': '319,318'},
 {'city': 'st-louis', 'year': '2000', 'population': '348,189'},
 {'city': 'hong-kong', 'year': '2030', 'population': '7,987,249'},
 {'city': 'hong-kong', 'year': '2025', 'population': '7,768,510'},
 {'city': 'hong-kong', 'year': '2020', 'population': '7,547,652'},
 {'city': 'hong-kong', 'year': '2015', 'population': '7,245,701'},
 {'city': 'hong-kong', 'year': '2010', 'population': '7,025,221'},
 {'city': 'hong-kong', 'year': '2005', 'population': '6,827,761'},
 {'city': 'hong-kong', 'year': '2000', 'population': '6,663,654'},
 {'city': 'hong-kong', 'year': '1995', 'population': '6,140,101'},
 {'city': 'london', 'year': '2030', 'population': '10,228,051'},
 {'city': 'london', 'year': '2025', 'population': '9,840,742'},
 {'city': 'london', 'year': '2020', 'population': '9,304,016'},
 {'city': 'london', 'year': '2015', 'population': '8,661,381'},
 {'city': 'london', 'year': '2010', 'population': '8,044,433'},
 {'city': 'london', 'year': '2005', 'population': '7,501,217'},
 {'city': 'london', 'year': '2000', 'population': '7,272,819'},
 {'city': 'london', 'year': '1995', 'population': '7,029,508'},
 {'city': 'singapore', 'year': '2030', 'population': '6,342,470'},
 {'city': 'singapore', 'year': '2025', 'population': '6,157,267'},
 {'city': 'singapore', 'year': '2020', 'population': '5,935,053'},
 {'city': 'singapore', 'year': '2015', 'population': '5,535,262'},
 {'city': 'singapore', 'year': '2010', 'population': '5,074,252'},
 {'city': 'singapore', 'year': '2005', 'population': '4,491,042'},
 {'city': 'singapore', 'year': '2000', 'population': '3,913,960'},
 {'city': 'singapore', 'year': '1995', 'population': '3,478,779'},
 {'city': 'paris', 'year': '2030', 'population': '11,709,788'},
 {'city': 'paris', 'year': '2025', 'population': '11,346,802'},
 {'city': 'paris', 'year': '2020', 'population': '11,017,230'},
 {'city': 'paris', 'year': '2015', 'population': '10,733,502'},
 {'city': 'paris', 'year': '2010', 'population': '10,460,118'},
 {'city': 'paris', 'year': '2005', 'population': '10,091,795'},
 {'city': 'paris', 'year': '2000', 'population': '9,736,538'},
 {'city': 'paris', 'year': '1995', 'population': '9,510,103'},
 {'city': 'dubai', 'year': '2030', 'population': '3,314,985'},
 {'city': 'dubai', 'year': '2025', 'population': '3,094,643'},
 {'city': 'dubai', 'year': '2020', 'population': '2,878,344'},
 {'city': 'dubai', 'year': '2015', 'population': '2,401,067'},
 {'city': 'dubai', 'year': '2010', 'population': '1,874,729'},
 {'city': 'dubai', 'year': '2005', 'population': '1,267,755'},
 {'city': 'dubai', 'year': '2000', 'population': '906,971'},
 {'city': 'dubai', 'year': '1995', 'population': '649,755'},
 {'city': 'kuala-lumpur', 'year': '2030', 'population': '9,805,249'},
 {'city': 'kuala-lumpur', 'year': '2025', 'population': '9,000,280'},
 {'city': 'kuala-lumpur', 'year': '2020', 'population': '7,996,830'},
 {'city': 'kuala-lumpur', 'year': '2015', 'population': '6,851,431'},
 {'city': 'kuala-lumpur', 'year': '2010', 'population': '5,809,953'},
 {'city': 'kuala-lumpur', 'year': '2005', 'population': '4,926,787'},
 {'city': 'kuala-lumpur', 'year': '2000', 'population': '4,176,469'},
 {'city': 'kuala-lumpur', 'year': '1995', 'population': '2,974,961'},
 {'city': 'phuket', 'year': '2030', 'population': '488,325'},
 {'city': 'phuket', 'year': '2025', 'population': '460,810'},
 {'city': 'phuket', 'year': '2020', 'population': '432,216'},
 {'city': 'phuket', 'year': '2015', 'population': '395,436'},
 {'city': 'phuket', 'year': '2010', 'population': '350,272'},
 {'city': 'phuket', 'year': '2005', 'population': '181,870'},
 {'city': 'phuket', 'year': '2000', 'population': '94,449'},
 {'city': 'phuket', 'year': '1995', 'population': '77,305'},

In [129]:
populations = pd.DataFrame(pops)
populations.tail(10)

          city  year population
369     berlin  -86,        978
370     athens  2030  3,163,463
371     athens  2025  3,155,318
372     athens  2020  3,153,355
373     athens  -7,8        002
374     athens  1995  3,121,652
375     taipei  2019    7871900
376     zagreb  2019     798966
377  reykjavik  2019     340235
378     athens  2019    3179434

In [130]:
populations = populations[populations.population != '']

In [131]:
len(populations['city'].unique())

44

In [132]:
populations[populations.duplicated() == True]

Empty DataFrame
Columns: [city, year, population]
Index: []

In [133]:
populations.city = populations.city.apply(lambda x: x.title().replace('-', ' '))

In [134]:
populations.city.value_counts()

Philadelphia      10
Minneapolis       10
New York City     10
San Diego         10
Los Angeles       10
Salt Lake City    10
Denver            10
Las Vegas         10
Portland          10
Phoenix           10
Washington Dc     10
Tampa             10
Houston           10
Chicago           10
Honolulu          10
San Francisco     10
Seattle           10
St Louis          10
Boston            10
Dallas            10
Miami             10
Charlotte         10
Atlanta           10
Orlando           10
Detroit           10
Antalya            8
Singapore          8
Rome               8
Berlin             8
Barcelona          8
Hong Kong          8
Dubai              8
Kuala Lumpur       8
Paris              8
Amsterdam          8
London             8
Delhi              8
Phuket             8
Seoul              7
Athens             6
Tokyo              5
Taipei             1
Zagreb             1
Reykjavik          1
Name: city, dtype: int64

In [135]:
populations.city = populations.city.replace('Washington Dc', 'Washington').replace('St Louis', 'St. Louis').replace('Zagreb', 'Croatia')

In [136]:
populations.head()

      city  year population
0  Atlanta  2018    498,044
1  Atlanta  2017    491,763
2  Atlanta  2016    478,916
3  Atlanta  2015    468,707
4  Atlanta  2014    460,998

In [137]:
populations['population'] = populations['population'].apply(lambda x: x.replace(',', '').replace('-', '0'))
populations['year'] = populations['year'].apply(lambda x: x.replace(',', '').replace('-', '0'))

In [138]:
populations['year'] = populations.year.astype(int)
populations['population'] = populations.population.astype(int)
populations['city'] = populations.city.astype(str)

In [139]:
populations['city'] = populations['city'].str.strip()

In [140]:
populations.head(10)

      city  year  population
0  Atlanta  2018      498044
1  Atlanta  2017      491763
2  Atlanta  2016      478916
3  Atlanta  2015      468707
4  Atlanta  2014      460998
5  Atlanta  2013      453791
6  Atlanta  2012      448799
7  Atlanta  2011      437563
8  Atlanta  2010      429193
9  Atlanta  2000      416474

In [141]:
populations.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 375 entries, 0 to 378
Data columns (total 3 columns):
city          375 non-null object
year          375 non-null int64
population    375 non-null int64
dtypes: int64(2), object(1)
memory usage: 11.7+ KB

In [142]:
type(populations.city[0])

str

In [143]:
finaldf = combined_df3.merge(populations, how='left', left_on=['Year', 'city'], right_on=['year', 'city'])

In [144]:
finaldf

,ds,city,PASSENGERS,Type,Month,Year,temperature_mean,precipitation,rain_days,pressure,cost_of_living_index,year,population
0,2010-01-01,Atlanta,2.73549e+06,Domestic,1,2010,3.6,137.0,7.0,1019.50,100.99,2010.0,429193.0
1,2010-01-01,Washington,1.92949e+06,Domestic,1,2010,0.4,57.0,8.0,1016.70,98.19,2010.0,605085.0
2,2010-01-01,Singapore,"1,681,005",International,1,2010,27.5,70.0,8.0,1011.60,65.94,2010.0,5074252.0
3,2010-01-01,Berlin,"489,487",International,1,2010,-4.9,21.0,7.0,1014.78,115.24,2010.0,3450395.0
4,2010-01-01,Paris,"4,154,249",International,1,2010,0.6,36.0,7.0,1015.60,130.30,2010.0,10460118.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4791,2019-01-01,San Francisco,2.46216e+06,Domestic,1,2019,12.7,117.0,8.0,1018.20,91.67,NaN,NaN
4792,2019-01-01,Seattle,1.52515e+06,Domestic,1,2019,7.2,97.0,14.0,1017.90,84.16,NaN,NaN
4793,2019-01-01,St. Louis,525918,Domestic,1,2019,-0.7,75.0,9.0,1021.70,66.77,NaN,NaN
4794,2019-01-01,Los Angeles,3.17744e+06,Domestic,1,2019,14.2,140.0,8.0,1018.90,78.20,NaN,NaN
4795,2019-01-01,Reykjavik,"164,744",International,1,2019,0.5,103.0,18.0,1007.10,102.20,2019.0,340235.0

In [145]:
del finaldf['year']

In [146]:
finaldf.isna().sum()

ds                         0
city                       0
PASSENGERS                 0
Type                       0
Month                      0
Year                       0
temperature_mean           0
precipitation              0
rain_days                  0
pressure                   0
cost_of_living_index       0
population              1732
dtype: int64

In [147]:
finaldf['population'] = finaldf.groupby(['city'])['population'].transform(lambda x: x.fillna(method='ffill'))
finaldf['population'] = finaldf.groupby(['city'])['population'].transform(lambda x: x.fillna(method='backfill'))

In [148]:
finaldf['PASSENGERS'] = finaldf['PASSENGERS'].apply(lambda x: x.strip().replace(',', '') if type(x) == str else x)
finaldf['PASSENGERS'] = finaldf['PASSENGERS'].astype(int)

In [149]:
finaldf = finaldf[finaldf['city'] != 'Antalya']

In [150]:
finaldf = finaldf[finaldf['city'] != 'Kuala Lumpur']

In [151]:
finaldf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4578 entries, 0 to 4795
Data columns (total 12 columns):
ds                      4578 non-null datetime64[ns]
city                    4578 non-null object
PASSENGERS              4578 non-null int64
Type                    4578 non-null object
Month                   4578 non-null int64
Year                    4578 non-null int64
temperature_mean        4578 non-null float64
precipitation           4578 non-null float64
rain_days               4578 non-null float64
pressure                4578 non-null float64
cost_of_living_index    4578 non-null float64
population              4578 non-null float64
dtypes: datetime64[ns](1), float64(6), int64(3), object(2)
memory usage: 465.0+ KB

In [152]:
finaldf.isna().sum()

ds                      0
city                    0
PASSENGERS              0
Type                    0
Month                   0
Year                    0
temperature_mean        0
precipitation           0
rain_days               0
pressure                0
cost_of_living_index    0
population              0
dtype: int64

In [153]:
finaldf

,ds,city,PASSENGERS,Type,Month,Year,temperature_mean,precipitation,rain_days,pressure,cost_of_living_index,population
0,2010-01-01,Atlanta,2735491,Domestic,1,2010,3.6,137.0,7.0,1019.50,100.99,429193.0
1,2010-01-01,Washington,1929494,Domestic,1,2010,0.4,57.0,8.0,1016.70,98.19,605085.0
2,2010-01-01,Singapore,1681005,International,1,2010,27.5,70.0,8.0,1011.60,65.94,5074252.0
3,2010-01-01,Berlin,489487,International,1,2010,-4.9,21.0,7.0,1014.78,115.24,3450395.0
4,2010-01-01,Paris,4154249,International,1,2010,0.6,36.0,7.0,1015.60,130.30,10460118.0
...,...,...,...,...,...,...,...,...,...,...,...,...
4791,2019-01-01,San Francisco,2462163,Domestic,1,2019,12.7,117.0,8.0,1018.20,91.67,883305.0
4792,2019-01-01,Seattle,1525148,Domestic,1,2019,7.2,97.0,14.0,1017.90,84.16,744955.0
4793,2019-01-01,St. Louis,525918,Domestic,1,2019,-0.7,75.0,9.0,1021.70,66.77,302838.0
4794,2019-01-01,Los Angeles,3177436,Domestic,1,2019,14.2,140.0,8.0,1018.90,78.20,3990456.0
4795,2019-01-01,Reykjavik,164744,International,1,2019,0.5,103.0,18.0,1007.10,102.20,340235.0

## Get Latitude & Longitude

In [154]:
df = pd.read_excel('worldcities.xlsx')
df.head()

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6850,139.7514,Japan,JP,JPN,TÅkyÅ,primary,35676000.0,1392685764
1,New York,New York,40.6943,-73.9249,United States,US,USA,New York,NaN,19354922.0,1840034016
2,Mexico City,Mexico City,19.4424,-99.1310,Mexico,MX,MEX,Ciudad de MÃ©xico,primary,19028000.0,1484247881
3,Mumbai,Mumbai,19.0170,72.8570,India,IN,IND,MahÄrÄshtra,admin,18978000.0,1356226629
4,SÃ£o Paulo,Sao Paulo,-23.5587,-46.6250,Brazil,BR,BRA,SÃ£o Paulo,admin,18845000.0,1076532519

In [155]:
df = df[['city_ascii', 'lat', 'lng', 'country', 'iso2', 'iso3']]
df.head()

    city_ascii      lat       lng        country iso2 iso3
0        Tokyo  35.6850  139.7514          Japan   JP  JPN
1     New York  40.6943  -73.9249  United States   US  USA
2  Mexico City  19.4424  -99.1310         Mexico   MX  MEX
3       Mumbai  19.0170   72.8570          India   IN  IND
4    Sao Paulo -23.5587  -46.6250         Brazil   BR  BRA

In [156]:
df['city_ascii'] = df['city_ascii'].replace('New York', 'New York City')
df['city_ascii'] = df['city_ascii'].replace('Zagreb', 'Croatia')

In [157]:
df = df.loc[:2700]

In [158]:
finaldf2 = finaldf.merge(df, how='left', left_on=['city'], right_on=['city_ascii'])

In [159]:
finaldf2.head(10)

,ds,city,PASSENGERS,Type,Month,Year,temperature_mean,precipitation,rain_days,pressure,cost_of_living_index,population,city_ascii,lat,lng,country,iso2,iso3
0,2010-01-01,Atlanta,2735491,Domestic,1,2010,3.6,137.0,7.0,1019.500,100.99,429193.0,Atlanta,33.7627,-84.4225,United States,US,USA
1,2010-01-01,Washington,1929494,Domestic,1,2010,0.4,57.0,8.0,1016.700,98.19,605085.0,Washington,38.9047,-77.0163,United States,US,USA
2,2010-01-01,Singapore,1681005,International,1,2010,27.5,70.0,8.0,1011.600,65.94,5074252.0,Singapore,1.2930,103.8558,Singapore,SG,SGP
3,2010-01-01,Berlin,489487,International,1,2010,-4.9,21.0,7.0,1014.780,115.24,3450395.0,Berlin,52.5218,13.4015,Germany,DE,DEU
4,2010-01-01,Paris,4154249,International,1,2010,0.6,36.0,7.0,1015.600,130.30,10460118.0,Paris,48.8667,2.3333,France,FR,FRA
5,2010-01-01,Dubai,1878388,International,1,2010,20.5,6.0,2.0,1018.875,74.45,1874729.0,Dubai,25.2300,55.2800,United Arab Emirates,AE,ARE
6,2010-01-01,Reykjavik,38726,International,1,2010,2.4,91.0,13.0,1009.000,93.31,340235.0,Reykjavik,64.1500,-21.9500,Iceland,IS,ISL
7,2010-01-01,Croatia,165000,International,1,2010,6.8,140.0,12.0,1011.500,75.60,798966.0,Croatia,45.8000,16.0000,Croatia,HR,HRV
8,2010-01-01,Athens,713100,International,1,2010,4.4,157.0,5.0,1019.000,71.36,3179434.0,Athens,37.9833,23.7333,Greece,GR,GRC
9,2010-01-01,Hong Kong,1906253,International,1,2010,14.1,151.0,9.0,1020.600,68.02,7025221.0,Hong Kong,22.3050,114.1850,Hong Kong,HK,HKG

In [160]:
finaldf2.isna().sum()

ds                      0
city                    0
PASSENGERS              0
Type                    0
Month                   0
Year                    0
temperature_mean        0
precipitation           0
rain_days               0
pressure                0
cost_of_living_index    0
population              0
city_ascii              0
lat                     0
lng                     0
country                 0
iso2                    0
iso3                    0
dtype: int64

In [161]:
finaldf2[finaldf2.lat.isnull()]

Empty DataFrame
Columns: [ds, city, PASSENGERS, Type, Month, Year, temperature_mean, precipitation, rain_days, pressure, cost_of_living_index, population, city_ascii, lat, lng, country, iso2, iso3]
Index: []

## Insert into MySQL

In [162]:
import mysql.connector
import config

In [163]:
import sqlalchemy
database_username = config.user
database_password = config.password
database_ip       = config.host
database_name     = 'Passengers'
database_connection = sqlalchemy.create_engine('mysql+mysqlconnector://{0}:{1}@{2}/{3}'.
                                               format(database_username, database_password, 
                                                      database_ip, database_name))

In [164]:
finaldf2.to_sql(con=database_connection, name='city_data', if_exists='replace')